{
    "left_wing_articles": {
        "status": "ok",
        "totalResults": 306,
        "articles": [
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell",
                "title": "Trump asks to delay sexual assault trial following historic indictment",
                "description": "Lawyers for former President Donald Trump asked a judge to delay the start of a sexual assault and defamation trial for one month to allow a \"cooling off\" period following the historic indictment charging Trump with falsifying business records.",
                "url": "https://www.cnn.com/2023/04/12/politics/e-jean-carroll-trump-lawyers-trial/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230412110016-e-jean-carroll-file-030420.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-12T10:27:14Z",
                "content": "Lawyers for former President Donald Trump asked a judge to delay the start of a sexual assault and defamation trial for one month to allow a cooling off period following the historic indictment charg… [+1322 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jeremy Herb",
                "title": "Next steps in the Donald Trump criminal case",
                "description": "Tuesday's arraignment of former President Donald Trump was a whirlwind of historic firsts as Trump was arrested and faced the first ever criminal charges against a former US president.",
                "url": "https://www.cnn.com/2023/04/05/politics/trump-criminal-case-whats-next/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405124344-merchan-trump-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T20:56:16Z",
                "content": "Tuesdays arraignment of former President Donald Trump was a whirlwind of historic firsts as Trump was arrested and faced the first ever criminal charges against a former US president.\r\nNow the wait b… [+7127 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Daniel Dale",
                "title": "Fact check: Here's the truth about crime in Manhattan",
                "description": "As former President Donald Trump and his allies attack Manhattan District Attorney Alvin Bragg, who is prosecuting Trump on felony charges of falsifying business records, the Republican-led House Judiciary Committee is holding a hearing Monday in Manhattan to…",
                "url": "https://www.cnn.com/2023/04/17/politics/fact-check-manhattan-crime-trump-bragg/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230414142010-jordan-bragg-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-17T09:00:29Z",
                "content": "As former President Donald Trump and his allies attack Manhattan District Attorney Alvin Bragg, who is prosecuting Trump on felony charges of falsifying business records, the Republican-led House Jud… [+6615 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Stephen Collinson",
                "title": "Analysis: America faces a fateful moment ahead of Trump arraignment",
                "description": "Donald Trump will take America through yet another grave and unprecedented national drama this week when he becomes the first ex-president to appear in court charged with a crime.",
                "url": "https://www.cnn.com/2023/04/03/politics/donald-trump-arraignment-fateful-moment/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230320111636-01-donald-trump-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-03T04:08:00Z",
                "content": "Donald Trump will take America through yet another grave and unprecedented national drama this week when he becomes the first ex-president to appear in court charged with a crime.\r\nThe 45th president… [+8621 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kristen Holmes",
                "title": "In between rounds of golf, Trump considers how best to use indictment as 2024 rallying cry",
                "description": "Former President Donald Trump spent the weekend before his history-making arraignment playing golf, posting on social media, meeting with advisers, and calling and texting allies to tout the political positives of his recent indictment.",
                "url": "https://www.cnn.com/2023/04/02/politics/trump-indictment-2024-rallying-cry/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230320113312-06-donald-trump-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-03T01:39:58Z",
                "content": "Former President Donald Trump spent the weekend before his history-making arraignment playing golf, posting on social media, meeting with advisers, and calling and texting allies to tout the politica… [+4765 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell, Devan Cole",
                "title": "Trump to sit for deposition in high-stakes civil lawsuit threatening the fate of his business empire",
                "description": "Donald Trump will be deposed Thursday as part of a high-stakes civil case brought by New York state against the former president, some of his children and his sprawling business empire.",
                "url": "https://www.cnn.com/2023/04/13/politics/trump-deposition-civil-lawsuit-new-york-trump-organization/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220527125228-01-donald-trump-letitia-james-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-13T10:30:41Z",
                "content": "Donald Trump will be deposed Thursday as part of a high-stakes civil case brought by New York state against the former president, some of his children and his sprawling business empire. \r\nThe lawsuit… [+1875 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Oliver Darcy",
                "title": "Tucker Carlson raged against Trump in private. But in interview with the former president he took a very different tone",
                "description": "Tucker Carlson plays a straight-shooter on television.",
                "url": "https://www.cnn.com/2023/04/12/media/carlson-trump-interview/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230412105733-tucker-carlson-donald-trump-interview-grab.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-12T10:07:46Z",
                "content": "Tucker Carlson plays a straight-shooter on television.\r\nFrom his prime time perch on Fox News, Carlson portrays himself to his loyal audience of millions as a truth-teller, someone who tells it like … [+2609 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Sara Murray, Katelyn Polantz, Devan Cole",
                "title": "Mike Pence won't appeal ruling ordering him to testify in special counsel probe, spokesman says",
                "description": "Mike Pence will not appeal a federal court ruling ordering him to testify in a special counsel probe into efforts by Donald Trump and his allies to subvert the 2020 election, a spokesman for the former vice president said Wednesday, teeing up a historic momen…",
                "url": "https://www.cnn.com/2023/04/05/politics/mike-pence/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230329105947-mike-pence-230316.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T19:18:52Z",
                "content": "Mike Pence will not appeal a federal court ruling ordering him to testify in a special counsel probe into efforts by Donald Trump and his allies to subvert the 2020 election, a spokesman for the form… [+3584 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "",
                "title": "Fishermen claim a beer bottle from a derailed rail car. Pope Francis consoles a grieving mother. The week in photos",
                "description": "Take a look at 32 photos of the week from March 30 to April 6.",
                "url": "https://www.cnn.com/2023/04/06/world/gallery/photos-this-week-march-30-april-6/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230406171734-33-week-in-photos-0406.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-07T12:03:11Z",
                "content": "Former US President Donald Trump was arraigned in a New York courtroom on Tuesday and pleaded not guilty to 34 felony criminal charges of falsifying business records.\r\nIt's the first time in American… [+592 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Oliver Darcy",
                "title": "News outlets will face slew of coverage conundrums as Trump is arraigned on criminal charges",
                "description": "History will unfold live before millions of television news viewers on Tuesday as former President Donald Trump travels to Manhattan Criminal Court to be arraigned after last week's unprecedented indictment.",
                "url": "https://www.cnn.com/2023/04/03/media/trump-coverage-reliable-sources/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230403165302-02-trump-trump-tower-230403.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T01:41:29Z",
                "content": "History will unfold live before millions of television news viewers on Tuesday as former President Donald Trump travels to Manhattan Criminal Court to be arraigned after last weeks unprecedented indi… [+3317 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Tierney Sneed",
                "title": "Why New York's hush money case against Donald Trump is viewed as risky",
                "description": "The case that Manhattan prosecutors have brought against former President Donald Trump for allegedly falsifying business records to disguise hush money payments related to the 2016 campaign presents novel legal questions that make the prosecution risky -- but…",
                "url": "https://www.cnn.com/2023/04/05/politics/trump-hush-money-indictment-bragg/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404164824-04-trump-indictment-unsealed.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T19:28:10Z",
                "content": "The case that Manhattan prosecutors have brought against former President Donald Trump for allegedly falsifying business records to disguise hush money payments related to the 2016 campaign presents … [+7753 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Stephen Collinson",
                "title": "The pulsating state politics that could shape America more than Trump's legal woes",
                "description": "Donald Trump may be getting all the headlines, but partisan struggles in state capitals across the country may do far more to change America than the drama surrounding the first ex-president to be charged with a crime.",
                "url": "https://www.cnn.com/2023/04/06/politics/state-political-battles-analysis/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405180255-protasiewicz-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-06T04:05:38Z",
                "content": "Donald Trump may be getting all the headlines, but partisan struggles in state capitals across the country may do far more to change America than the drama surrounding the first ex-president to be ch… [+8822 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Elliot Williams",
                "title": "Opinion: The justice system Trump and other white-collar defendants see is different than what most accused criminals get",
                "description": "Despite Trump's claims of selective prosecution, he will be treated like any other accused criminal. That won't work out too badly for Trump, writes Elliot Williams, given that the \"any other\" here refers only to white-collar criminals.",
                "url": "https://www.cnn.com/2023/04/10/opinions/trump-white-collar-crime-williams/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230410103328-01-trump-white-collar-crime-williams-opinion.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-10T17:26:01Z",
                "content": "Editors Note: Elliot Williams is a CNN legal analyst. He is a former deputy assistant attorney general at the Justice Department and is currently a principal at The Raben Group, a public affairs firm… [+5779 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Steve Contorno",
                "title": "DeSantis goes to Washington, a place he once despised, looking for support to take on Trump",
                "description": "Florida Gov. Ron DeSantis will meet behind closed doors with a select group of congressional Republicans on Tuesday evening in Washington as he seeks support from within his party to challenge Donald Trump for the GOP nomination in 2024.",
                "url": "https://www.cnn.com/2023/04/18/politics/ron-desantis-capitol-hill-visit/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230418142849-ron-desantis-230417.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-18T19:12:51Z",
                "content": "Florida Gov. Ron DeSantis will meet behind closed doors with a select group of congressional Republicans on Tuesday evening in Washington as he seeks support from within his party to challenge Donald… [+5005 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Annie Grayer,Sara Murray",
                "title": "House GOP escalates defense of Trump with New York field hearing seeking to discredit Manhattan DA",
                "description": "House Republicans on the Judiciary Committee are exemplifying the lengths they are willing to go to discredit Manhattan District Attorney Alvin Bragg's criminal case against former President Donald Trump with a Monday New York field hearing on Bragg's home tu…",
                "url": "https://www.cnn.com/2023/04/17/politics/house-republican-field-hearing-manhattan-da/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230411134338-jim-jordan-alvin-bragg-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-17T10:00:29Z",
                "content": "House Republicans on the Judiciary Committee are exemplifying the lengths they are willing to go to discredit Manhattan District Attorney Alvin Braggs criminal case against former President Donald Tr… [+8085 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Casey Gannon, Katelyn Polantz",
                "title": "Stephen Miller returns to grand jury to testify about January 6 conversations with Trump",
                "description": "Donald Trump's close presidential aide and speechwriter Stephen Miller returned to testify to a federal grand jury in Washington on Tuesday after the courts ordered that he and other top advisers must share their recollections of direct conversations with the…",
                "url": "https://www.cnn.com/2023/04/11/politics/stephen-miller-testifying-grand-jury/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221129195324-stephen-miller-2021-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-11T15:03:22Z",
                "content": "Donald Trumps close presidential aide and speechwriter Stephen Miller returned to testify to a federal grand jury in Washington on Tuesday after the courts ordered that he and other top advisers must… [+2580 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Natasha Bertrand, Lauren Fox, Alayna Treene",
                "title": "Key lawmakers are granted access to Biden, Trump and Pence classified documents",
                "description": "The \"Gang of Eight\" has been granted the ability to look over the classified documents found in the possession of President Joe Biden, former President Donald Trump and former Vice President Mike Pence, three sources familiar with the matter tell CNN.",
                "url": "https://www.cnn.com/2023/04/11/politics/gang-of-eight-classified-documents/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221201175631-us-capitol-building-file-112822.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-11T14:29:46Z",
                "content": "The Gang of Eight has been granted the ability to look over the classified documents found in the possession of President Joe Biden, former President Donald Trump and former Vice President Mike Pence… [+1145 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Zachary Cohen",
                "title": "Exclusive: National security officials tell special counsel Trump was repeatedly warned he did not have the authority to seize voting machines",
                "description": "Former top national security officials have testified to a federal grand jury that they repeatedly told former President Donald Trump and his allies that the government didn't have the authority to seize voting machines after the 2020 election, CNN has learne…",
                "url": "https://www.cnn.com/2023/04/05/politics/election-voting-machines-trump-national-security/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405082542-02-donald-trump-oval-office-file-120720.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T16:00:42Z",
                "content": "Former top national security officials have testified to a federal grand jury that they repeatedly told former President Donald Trump and his allies that the government didnt have the authority to se… [+6825 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Patrick T. Brown",
                "title": "Opinion: Don't count DeSantis out yet; the GOP's 2024 race is far from over",
                "description": "The GOP race for 2024 is far from over, writes Patrick T. Brown. Florida Gov. Ron DeSantis may have lost a step or two in recent polls. But his track record of governance should force voters to think long and hard about what version of the GOP they put forwar…",
                "url": "https://www.cnn.com/2023/04/11/opinions/ron-desantis-versus-donald-trump-2024-race-brown/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230328160915-ron-desantis-230310.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-11T15:24:56Z",
                "content": "Editors Note: Patrick T. Brown is a fellow at the Ethics and Public Policy Center, a conservative think tank and advocacy group based in Washington, DC. He is also a former senior policy adviser to C… [+6324 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Fredreka Schouten, Marshall Cohen",
                "title": "GOP distrust in voting machines persists as Dominion and Fox News head to legal showdown",
                "description": "The decision by a majority of supervisors in this deeply conservative California County to end a contract with Dominion Voting Systems illustrates how the attacks against the company continue to reverberate more than two years after the 2020 election. Dominio…",
                "url": "https://www.cnn.com/2023/04/11/politics/dominion-fox-news-voting-machines/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230410120755-01-dominion-voting-shasta-county-fox-news.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-11T11:10:22Z",
                "content": "First, the Shasta County Board of Supervisors in rural northern California voted to cancel its contract with Dominion Voting Systems, citing public distrust of the companys machines.\r\nThen, the super… [+10058 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jennifer Agiesta",
                "title": "CNN Poll: One-third of Americans say Biden deserves to be reelected in 2024",
                "description": "Just a third of Americans say President Joe Biden deserves to be reelected, according to a new CNN Poll conducted by SSRS, as a majority in his party say they would like to see someone else as the Democratic nominee for president next year.",
                "url": "https://www.cnn.com/2023/04/06/politics/cnn-poll-biden-reelection-2024/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405224752-01-joe-biden-040423.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-06T16:00:15Z",
                "content": "Just a third of Americans say President Joe Biden deserves to be reelected, according to a new CNN Poll conducted by SSRS, as a majority in his party say they would like to see someone else as the De… [+7092 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Marshall Cohen, Kate Trafecante",
                "title": "Tucker Carlson, Sean Hannity among prominent Fox hosts, execs set to take stand at defamation trial",
                "description": "Fox News said in a court filing Tuesday that it plans to put some of its most prominent executives and TV hosts on the witness stand to testify as part of its defense in the Dominion defamation trial.",
                "url": "https://www.cnn.com/2023/04/04/media/tucker-carlson-sean-hannity-fox-news-dominion/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404191406-tucker-carlson-sean-hannity-split-042023.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T23:28:22Z",
                "content": "Fox News said in a court filing Tuesday that it plans to put some of its most prominent executives and TV hosts on the witness stand to testify as part of its defense in the Dominion defamation trial… [+1403 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Deidre McPhillips",
                "title": "Access to reproductive health care has become more challenging in the US, study shows",
                "description": "As abortion rights become more restricted in the United States, a new study shows that it's become harder for women to access reproductive health care services -- such as routine screenings and birth control -- in recent years. ((Did this study focus on non-a…",
                "url": "https://www.cnn.com/2023/04/10/health/reproductive-health-barriers-wellness/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230410103359-doctor-and-patient-stock.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-10T15:06:35Z",
                "content": "As abortion rights become more restricted in the United States, a new study shows that its become harder for women to access reproductive health care services more broadly such as routine screenings … [+2390 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Katie Lobosco",
                "title": "Biden's student loan pause faces another lawsuit",
                "description": "The Biden administration is facing another lawsuit over extending the pandemic-related pause on federal student loan payments.",
                "url": "https://www.cnn.com/2023/04/07/politics/student-loan-pause-lawsuit/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230407122138-student-graduate-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-07T16:39:52Z",
                "content": "The Biden administration is facing another lawsuit over extending the pandemic-related pause on federal student loan payments. \r\nThe pause is set to end later this year, but the plaintiffs want the m… [+2089 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Tierney Sneed, Lauren Fox",
                "title": "Biden judicial push hits roadblocks with GOP veto-power and Democratic absences",
                "description": "The remarkable pace with which President Joe Biden has sought to remake the federal bench has been put into jeopardy by dual threats: Democratic Senate absences and a Senate rule that gives Republicans the ability to veto district court nominees for courts in…",
                "url": "https://www.cnn.com/2023/04/10/politics/biden-judges-senate-blue-slips-absences/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221024155621-biden-student-loans-1021.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-10T12:01:05Z",
                "content": "The remarkable pace with which President Joe Biden has sought to remake the federal bench has been put into jeopardy by dual threats: Democratic Senate absences and a Senate rule that gives Republica… [+8297 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Eric Levenson,Marshall Cohen",
                "title": "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory",
                "description": "For all the interest in big-name witnesses and eye-opening private text messages, at the core of the defamation lawsuit filed by Dominion Voting Systems against Fox News are 20 specific broadcasts and tweets in which the voting company says Fox knowingly prom…",
                "url": "https://www.cnn.com/2023/04/17/media/dominion-fox-news-allegations/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230414161317-fox-news-headquarters-0412.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-17T13:44:34Z",
                "content": "For all the interest in big-name witnesses and eye-opening private text messages, at the core of the defamation lawsuit filed by Dominion Voting Systems against Fox News are 20 specific broadcasts an… [+11179 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Marshall Cohen",
                "title": "Fox-Dominion trial delay 'is not unusual,' judge says",
                "description": "Delaware Superior Court Judge Eric Davis said Monday that the delay in the Fox-Dominion defamation trial \"is not unusual\" and told the parties that he expects them back on Tuesday to finish jury selection.",
                "url": "https://www.cnn.com/2023/04/17/media/fox-dominion-judge-delay/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230417091912-fox-dominion-trial-wilmington-delaware-0417-restricted.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-17T13:46:30Z",
                "content": "Delaware Superior Court Judge Eric Davis said Monday that the delay in the Fox-Dominion defamation trial is not unusual and told the parties that he expects them back on Tuesday to finish jury select… [+3103 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Marshall Cohen",
                "title": "Jury selection to begin in Dominion's defamation trial against Fox News",
                "description": "Jury selection is set to begin Thursday in Dominion Voting Systems' $1.6 billion defamation trial against Fox News over the right-wing network's promotion of debunked conspiracy theories about the 2020 presidential election.",
                "url": "https://www.cnn.com/2023/04/13/media/fox-news-dominion-trial-jury/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230413105214-fox-news-jury-selection-030923.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-13T10:35:51Z",
                "content": "Jury selection is set to begin Thursday in Dominion Voting Systems $1.6 billion defamation trial against Fox News over the right-wing networks promotion of debunked conspiracy theories about the 2020… [+3017 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "John Blake",
                "title": "Analysis: Predictions about the decline of Christianity in America may be premature",
                "description": "Pundits in the US have been warning that Christianity is on the decline, citing shrinking church membership and polls showing that fewer Americans call themselves Christians. But some scholars say help is on the way.",
                "url": "https://www.cnn.com/2023/04/08/us/christianity-decline-easter-blake-cec/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405164937-01-christianity-decline-easter.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-08T12:36:06Z",
                "content": "The cross, and the empty tomb.\r\nBoth Christian symbols are bookends to the Easter story. One symbolizes the tragic execution of Jesus while the other represents the Christian belief in his resurrecti… [+12068 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jemar Tisby",
                "title": "Opinion: Expulsion of the 'Tennessee Three' is a chilling echo of Jim Crow",
                "description": "When Republicans in the Tennessee House of Representatives voted this week to expel two Black members, they revealed their resemblance to the anti-democratic, authoritarian Redeemers of more than a century ago, writes Jemar Tisby.",
                "url": "https://www.cnn.com/2023/04/08/opinions/tennessee-three-expulsion-redeemers-tisby/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230406211201-13-tennessee-lawmaker-expulsion-0406.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-08T16:27:19Z",
                "content": "Editors Note: Jemar Tisby, a professor of history at Simmons College of Kentucky, is the author of the books The Color of Compromise and How to Fight Racism. He writes frequently at JemarTisby.Substa… [+7262 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Dean Obeidallah",
                "title": "Opinion: Is Tucker Carlson the reason Texas Gov. Abbott says he'll pardon a convicted killer?",
                "description": "Texas Gov. Gregg Abbott announced this weekend that he plans to pardon a defendant convicted last week in the shooting death of a US military veteran who took part in a 2020 Black Lives Matter protest.",
                "url": "https://www.cnn.com/2023/04/10/opinions/texas-abbott-pardon-murder-trial-obeidallah/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230409194903-greg-abbott-daniel-perry-obeidallah-restricted.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-10T19:03:38Z",
                "content": "Editors Note: Dean Obeidallah, a former attorney, is the host of SiriusXM radios daily program The Dean Obeidallah Show. Follow him @DeanObeidallah@masto.ai. The opinions expressed in this commentary… [+5988 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jessie Yeung",
                "title": "The city without TikTok offers a window to America's potential future",
                "description": "Across the United States, more than 150 million people are being faced with the possibility of a new reality: life without TikTok.",
                "url": "https://www.cnn.com/2023/04/08/tech/hong-kong-tiktok-ban-intl-hnk-dst/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405112634-tiktok-user-ban-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-09T00:30:56Z",
                "content": "Across the United States, more than 150 million people are being faced with the possibility of a new reality: life without TikTok.\r\nThe wildly popular short-form video app has been at the center of a… [+7301 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": null,
                "title": "DETAILS: Covering Courthouse Circus...",
                "description": "DETAILS: Covering Courthouse Circus...\r\n\n \n \n \n (First column, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Trump, Trump, Trump -- TV turns to old habits...\r\nAnd trial could be televised under new Albany bill!\r\nGAG: Big Mouth Might Send Him to Jail Early...\r…",
                "url": "https://view.newsletters.cnn.com/messages/168057035262950b117ae5293/raw?utm_term=168057035262950b117ae5293",
                "urlToImage": null,
                "publishedAt": "2023-04-04T01:19:37Z",
                "content": "History will unfold live before millions of television news viewers on Tuesday as former President Donald Trump travels to Manhattan Criminal Court to be arraigned after last week's unprecedented ind… [+3182 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Richard Galant",
                "title": "Opinion: Trump's unlikely Manhattan story faces unprecedented moment",
                "description": "Manhattan was the place where Donald Trump's career began in the 1970s when he moved into a \"dark, dingy\" studio apartment and began courting the city's power brokers. This week, he is expected to face charges in a courtroom a few miles from his first home in…",
                "url": "https://www.cnn.com/2023/04/02/opinions/trumps-manhattan-story-opinion-column-galant/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230402072915-manhattan-skyline-sunset.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-02T12:14:03Z",
                "content": "Editors Note: Sign up to get this weekly column as a newsletter. Were looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\nIn 1971, an Ivy League graduate in… [+13691 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": null,
                "title": "Opinion: Texas judge's stunning ruling caps extraordinary week",
                "description": "The week that began with former president Donald Trump facing a judge in Manhattan ended with a Trump-appointed judge overturning more than two decades of medical practice and Tennessee expelling two legislators for protesting in favor of gun control. Electio…",
                "url": "https://www.cnn.com/2023/04/09/opinions/texas-judge-caps-dramatic-week-opinion-column-galant/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404114538-11-trump-arraignment-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-09T12:12:38Z",
                "content": "Editors Note: Sign up to get this weekly column as a newsletter. Were looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\nO, for a muse of fire, pleads the … [+14582 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Harry Enten",
                "title": "Why Trump is still favored for the GOP nomination, despite his indictment",
                "description": "Donald Trump is the first former president to be indicted. Given that move by a New York grand jury and the other high-profile criminal cases involving Trump, you might think his political fortunes are endangered.",
                "url": "https://www.cnn.com/2023/04/02/politics/2024-republican-president-trump-indictment/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230401131222-donald-trump-dc-speak-072622.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-02T12:14:40Z",
                "content": "Donald Trump is the first former president to be indicted. Given that move by a New York grand jury and the other high-profile criminal cases involving Trump, you might think his political fortunes a… [+5245 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kristen Holmes",
                "title": "Senate GOP campaign committee chair endorses Trump",
                "description": "Montana Sen. Steve Daines, the head of the Senate GOP's campaign arm, endorsed former President Donald Trump Monday night.",
                "url": "https://www.cnn.com/2023/04/24/politics/steve-daines-nrsc-senate-trump-endorsement/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230424201247-steve-daines-0322.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-25T00:42:32Z",
                "content": "Montana Sen. Steve Daines, the head of the Senate GOPs campaign arm, endorsed former President Donald Trump Monday night. \r\nThe best four years Ive had in the US Senate is when President Trump was se… [+2459 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Manu Raju, Alayna Treene",
                "title": "Senate Republicans confront 2024 primary challenges and Trump's influence",
                "description": "Kari Lake -- the unapologetic supporter of former President Donald Trump and vanquished candidate for Arizona governor -- privately made a trip to National Republican Senatorial Committee headquarters in February where she discussed the prospects of shaking u…",
                "url": "https://www.cnn.com/2023/04/10/politics/senate-republicans-primary-challenges-trump/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230407180716-02-senate-republicans-trump-042023.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-10T16:00:00Z",
                "content": "Kari Lake the unapologetic supporter of former President Donald Trump and vanquished candidate for Arizona governor privately made a trip to National Republican Senatorial Committee headquarters in F… [+15883 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Fredreka Schouten",
                "title": "Trump files personal financial disclosure report",
                "description": "Former President Donald Trump on Friday filed his personal financial disclosure report with the Federal Election Commission -- offering the public a first look at his post-presidential finances.",
                "url": "https://www.cnn.com/2023/04/14/politics/trump-financial-disclosure/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230414133353-trump-nyc-0414.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-14T20:52:02Z",
                "content": "Former President Donald Trump on Friday filed his personal financial disclosure report with the Federal Election Commission offering the public a first look at his post-presidential finances.\r\nThe re… [+622 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Daniel Dale",
                "title": "Fact check: Trump's latest false climate figure is off by more than 1,000 times",
                "description": "Former President Donald Trump keeps using wildly inaccurate figures to minimize the threat of climate change.",
                "url": "https://www.cnn.com/2023/04/24/politics/fact-check-trump-sea-levels-ocean-climate-change/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230415111342-07-trump-mar-a-lago-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-24T18:16:01Z",
                "content": "Former President Donald Trump keeps using wildly inaccurate figures to minimize the threat of climate change.\r\nTrump, now a presidential candidate, has argued in speeches and interviews that the risk… [+3828 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Stephen Collinson",
                "title": "Concurrent criminal and civil cases subject Trump to unprecedented legal pressure",
                "description": "It's a different week but a similar story for Donald Trump.",
                "url": "https://www.cnn.com/2023/04/13/politics/donald-trump-criminal-civil-cases/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404110809-10-trump-arraignment-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-13T04:11:39Z",
                "content": "Its a different week but a similar story for Donald Trump.\r\nHes due back in New York on Thursday under a dark legal cloud to answer more questions about his conduct, a week after becoming the first e… [+8336 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Tierney Sneed, Hannah Rabinowitz, Katelyn Polantz, Fredreka Schouten, Devan Cole",
                "title": "Takeaways and key lines from the indictment against Donald Trump",
                "description": "The historic indictment and related court documents against former President Donald Trump have been unsealed.",
                "url": "https://www.cnn.com/2023/04/04/politics/takeaways-donald-trump-indictment/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230330164942-20220330-trump-indictment-illustration-generic.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T21:09:25Z",
                "content": "The historic indictment and related court documents against former President Donald Trump have been unsealed. \r\nThe criminal charges stem from Manhattan District Attorney Alvin Braggs investigation i… [+4640 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Dan Berman",
                "title": "Stormy Daniels ordered to pay Trump team another $120,000 in legal fees",
                "description": "Three thousand miles away from his New York legal drama, Donald Trump secured a substantial victory in another court.",
                "url": "https://www.cnn.com/2023/04/04/politics/stormy-daniels-pay-trump-legal-fees/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404222853-stormy-daniels-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T02:56:44Z",
                "content": "Three thousand miles away from his New York legal drama, Donald Trump secured a substantial victory in another court. \r\nThe 9th US Circuit Court of Appeals sided with the former president in his effo… [+2134 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Lauren del Valle,Kara Scannell",
                "title": "E. Jean Carroll battery and defamation trial against Donald Trump begins: What to know",
                "description": "The civil battery and defamation trial for columnist E. Jean Carroll against former President Donald Trump is set to begin Tuesday.",
                "url": "https://www.cnn.com/2023/04/25/politics/e-jean-carroll-trump-defamation-trial/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230323142611-e-jean-carroll-donald-trump-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-25T09:00:09Z",
                "content": "The civil battery and defamation trial for columnist E. Jean Carroll against former President Donald Trump is set to begin Tuesday. \r\nCarroll alleges Trump forcibly raped and groped her in a Manhatta… [+9264 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Nicole Hemmer",
                "title": "Opinion: The day Trump became just another defendant",
                "description": "Historian Nicole Hemmer writes that while the atmosphere outside the courtroom may have been a spectacle, the first images of former president Donald Trump as a defendant were striking for their lack thereof.",
                "url": "https://www.cnn.com/2023/04/04/opinions/trump-the-defendant-at-arraignment-hemmer/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404180819-pano-donald-trump-corte.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T23:59:00Z",
                "content": "Editors Note: Nicole Hemmer is an associate professor of history and director of the Carolyn T. and Robert M. Rogers Center for the Study of the Presidency at Vanderbilt University. She is the author… [+5381 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, Mike Hayes and <a href=\"/profiles/kaanita-iyer\">Kaanita Iyer</a>, CNN",
                "title": "Trump to appear in New York court after historic indictment",
                "description": "Donald Trump, the first current or former president in US history to face criminal charges, is expected to be arraigned Tuesday after being indicted last week by a Manhattan grand jury. Follow here for the latest live news updates.",
                "url": "https://www.cnn.com/politics/live-news/trump-new-york-court-arraignment-04-04-23/index.html",
                "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/230403163610-01-trump-trump-tower-230403-super-tease.jpg",
                "publishedAt": "2023-04-04T09:01:42Z",
                "content": "Former President Donald Trumps legal team will look to challenge every potential issue in his indictment once the charges are unsealed, an attorney for the former president told CNN Sunday.\r\nWere not… [+2444 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell",
                "title": "Former Trump Org. CFO Allen Weisselberg is released from Rikers Island jail",
                "description": "Allen Weisselberg, the former chief financial officer of the Trump Organization, served roughly four months for his role in a decade-long tax fraud scheme.",
                "url": "https://www.cnn.com/2023/04/19/politics/allen-weisselberg-released-rikers/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230110123103-allen-weisselberg-file-111722.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-19T17:37:48Z",
                "content": "Allen Weisselberg, the former chief financial officer of the Trump Organization, was released from jail on Wednesday after serving roughly four months for his role in a decade-long tax fraud scheme. … [+1768 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "David Wright",
                "title": "Trump-aligned Arizona sheriff to officially enter key Senate race",
                "description": "Mark Lamb, the sheriff of Pinal County, has filed paperwork to run for Senate in Arizona, entering the unpredictable three-way race for the seat currently held by independent Sen. Kyrsten Sinema.",
                "url": "https://www.cnn.com/2023/04/11/politics/mark-lamb-arizona-senate/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230411135239-mark-lamb-070722.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-11T13:08:47Z",
                "content": "Mark Lamb, the sheriff of Pinal County, has filed paperwork to run for Senate in Arizona, entering the unpredictable three-way race for the seat currently held by independent Sen. Kyrsten Sinema. \r\nL… [+2290 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Alayna Treene,Kristen Holmes,Fredreka Schouten",
                "title": "Trump campaign says it saw surge in donations after indictment",
                "description": "Former President Donald Trump raised a combined $18.8 million in the first quarter of 2023 through his joint fundraising committee and his campaign -- and saw a spike in donations after being indicted by a Manhattan grand jury on March 30, according to new fi…",
                "url": "https://www.cnn.com/2023/04/15/politics/donald-trump-indictment-fundraising/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230415111342-07-trump-mar-a-lago-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-15T15:56:52Z",
                "content": "Former President Donald Trump raised a combined $18.8 million in the first quarter of 2023 through his joint fundraising committee and his campaign and saw a spike in donations after being indicted b… [+2484 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jennifer Agiesta",
                "title": "CNN Poll: Majority of Americans approve of Trump indictment",
                "description": "Sixty percent of Americans approve of the indictment of former President Donald Trump, according to a new CNN Poll conducted by SSRS following the news that a New York grand jury voted to charge him in connection with hush money payments made to adult film ac…",
                "url": "https://www.cnn.com/2023/04/03/politics/cnn-poll-trump-indictment/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230320112420-03-donald-trump-file-restricted.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-03T13:00:58Z",
                "content": "Sixty percent of Americans approve of the indictment of former President Donald Trump, according to a new CNN Poll conducted by SSRS following the news that a New York grand jury voted to charge him … [+5424 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "John Dean, Norm Eisen",
                "title": "Opinion: Alvin Bragg was right to prosecute Donald Trump",
                "description": "This week brought an unprecedented event in American history -- the first criminal charges against a former president. Manhattan District Attorney Alvin Bragg unveiled an indictment against Donald Trump with 34 counts of violating New York State's law against…",
                "url": "https://www.cnn.com/2023/04/05/opinions/alvin-bragg-prosecute-donald-trump-dean-eisen/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404150445-15-trump-arraignment-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T11:29:40Z",
                "content": "Editors Note: Norman Eisen is a CNN legal analyst who was former President Barack Obamas ethics czar and impeachment counsel to the House Judiciary Committee in 2019-2020. John W. Dean is a CNN contr… [+6186 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Andrew Kaczynski",
                "title": "Trump previously backed policies on Social Security for which he's now attacking DeSantis, calling the program a 'Ponzi scheme'",
                "description": "Former President Donald Trump once backed raising the retirement age to 70 and called for privatizing Social Security which he called a \"Ponzi scheme\" -- two positions he has hammered Florida Gov. Ron DeSantis for supporting as a former member of Congress and…",
                "url": "https://www.cnn.com/2023/04/27/politics/trump-desantis-social-security-ponzi-scheme/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230419113033-donald-trump-0414.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-27T11:02:43Z",
                "content": "Former President Donald Trump once backed raising the retirement age to 70 and called for privatizing Social Security which he called a Ponzi scheme two positions he has hammered Florida Gov. Ron DeS… [+5514 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Andrew Torgan, Daniel Wine",
                "title": "Start your week smart: Deadly tornadoes, Trump indictment, Medicaid coverage",
                "description": "Here's what you need to know to Start Your Week Smart.",
                "url": "https://www.cnn.com/2023/04/02/us/five-things-april-2-trnd/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230402020232-01-tornado-indiana-040123.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-02T12:55:17Z",
                "content": "When you think about breakfast, what comes to mind? Pancakes? Bacon and eggs? Maybe oatmeal or a blueberry muffin? What about a hot cup of ramen noodles?\r\nHeres what else you need to know to Start Yo… [+5946 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "",
                "title": "Trump to appear at CNN town hall in New Hampshire",
                "description": "Former President Donald Trump will participate in a CNN presidential town hall next week in New Hampshire, the network announced Monday.",
                "url": "https://www.cnn.com/2023/05/01/politics/donald-trump-town-hall/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230501145313-donald-trump-new-hampshire-230427.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-05-01T18:56:46Z",
                "content": "Former President Donald Trump will participate in a CNN presidential town hall next week in New Hampshire, the network announced Monday.\r\nThe former president will take questions from New Hampshire R… [+226 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Joan Biskupic",
                "title": "Inside Donald Trump's rocky relationship with the Supreme Court",
                "description": "Some Supreme Court justices thought Donald Trump was setting them up. Two days after the official swearing-in of Justice Brett Kavanaugh in October 2018, the president arranged a televised ceremony at the White House and invited all the justices.",
                "url": "https://www.cnn.com/2023/04/03/politics/trump-supreme-court-roberts-kavanaugh-biskupic-nine-black-robes/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210317151624-kavanaugh-for-asha-rangappa-oped.jpg?q=x_354,y_92,h_2190,w_3891,c_crop/w_800",
                "publishedAt": "2023-04-03T09:42:41Z",
                "content": "Editors Note: Adapted from NINE BLACK ROBES: Inside the Supreme Courts Drive to the Right and Its Historic Consequences, by Joan Biskupic, published by William Morrow.\r\nSome Supreme Court justices th… [+15143 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Zachary B. Wolf",
                "title": "Election 2024: A consequential rematch of serial candidates",
                "description": "This could be the most consequential rematch in US history -- a president who portrays himself as the champion of democracy against a former president who routinely rejects election results.",
                "url": "https://www.cnn.com/2023/04/24/politics/old-men-for-president-what-matters/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230424163501-trump-biden-what-matters.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-24T22:10:15Z",
                "content": "A version of this story appeared in CNNs What Matters newsletter. To get it in your inbox, sign up for free here. \r\nThis could be the most consequential rematch in US history a president who portrays… [+6592 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Lauren del Valle",
                "title": "Carroll testifies: 'Donald Trump raped me and when I wrote about it, he said it didn't happen'",
                "description": "Former magazine columnist E. Jean Carroll took the stand Wednesday morning in her battery and defamation lawsuit against former President Donald Trump.",
                "url": "https://www.cnn.com/2023/04/26/politics/e-jean-carroll-trump-lawsuit-testimony/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230426102010-02-trump-e-jean-carroll-lawsuit-230426.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-26T15:46:44Z",
                "content": "Former magazine columnist E. Jean Carroll took the stand Wednesday morning in her battery and defamation lawsuit against former President Donald Trump.\r\nIm here because Donald Trump raped me, and whe… [+1409 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Alli Rosenbloom",
                "title": "'SNL' cold open tackles Trump's indictment",
                "description": "The cold open of \"Saturday Night Live\" featured comedian James Austin Johnson considering possible jail time as an indicted former President Donald Trump.",
                "url": "https://www.cnn.com/2023/04/02/entertainment/snl-cold-open-trump-indictment/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230401235803-01-snl-cold-open-040123.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-02T04:43:02Z",
                "content": "The cold open of Saturday Night Live featured comedian James Austin Johnson considering possible jail time as an indicted former President Donald Trump.\r\nWell folks it happened. I got indicted, Johns… [+1727 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Katelyn Polantz,Sara Murray",
                "title": "Special counsel prosecutors press witnesses for details about how Trump has paid for their lawyers",
                "description": "Federal prosecutors investigating former President Donald Trump's handling of classified documents are pressing multiple witnesses for details about their attorneys, including whether any of them have attempted to influence testimony in order to protect the f…",
                "url": "https://www.cnn.com/2023/04/14/politics/special-counsel-witnesses-maralago-trump-paid-lawyers/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221005162326-mar-a-lago-0914.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-14T16:00:10Z",
                "content": "Federal prosecutors investigating former President Donald Trumps handling of classified documents are pressing multiple witnesses for details about their attorneys, including whether any of them have… [+5283 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Lauren del Valle",
                "title": "Judge in E. Jean Carroll trial warns Trump about social media comments",
                "description": "The judge overseeing a civil battery and defamation trial for columnist E. Jean Carroll against Donald Trump warned the former president's counsel on Wednesday about comments their client made on social media about the case.",
                "url": "https://www.cnn.com/2023/04/26/politics/trump-e-jean-carroll-trial-warning-social-media/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230424182529-donald-trump-juicio-violacion-difamiacion-jean-carroll-eeuu-dusa-morales-00023920.png?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-26T15:12:59Z",
                "content": "The judge overseeing a civil battery and defamation trial for columnist E. Jean Carroll against Donald Trump warned the former presidents counsel on Wednesday about comments their client made on soci… [+1245 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": null,
                "title": "ROUND-UP...",
                "description": "ROUND-UP...\r\n\n \n \n \n (Top headline, 7th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:THE WOMAN WHO BROUGHT DOWN TUCKER?\r\nPAPER: Exit related to new discrimination suit...\r\nPRODUCER CLAIMED RAMPANT HARASSMENT...\r\nThe 'Uncontrollable' Host, Who Even Badmouthed His…",
                "url": "https://view.newsletters.cnn.com/messages/16823975905898f5a9dcbb4d3/raw?utm_term=16823975905898f5a9dcbb4d3",
                "urlToImage": null,
                "publishedAt": "2023-04-25T06:01:36Z",
                "content": "Why? \r\nThat is the question I have been asked and expect to continue to be asked more than any other after the seismic news that Fox Newshad fired its highest-rated host, Tucker Carlson. The news, wh… [+4439 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell",
                "title": "Next week's Trump assault and defamation trial in NYC won't be delayed, judge says",
                "description": "Jury selection begins next Tuesday in E. Jean Carroll's lawsuit alleging that Trump raped her in a New York dressing room in the mid-1990s",
                "url": "https://www.cnn.com/2023/04/17/politics/trump-e-jean-carroll-trial-delay-request/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230323142611-e-jean-carroll-donald-trump-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-17T14:44:01Z",
                "content": "A federal judge on Monday denied for a second time former President Donald Trumps request to delay an assault and defamation trial set to begin next week in New York. \r\nTrumps attorneys asked for the… [+2101 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Noah Gray, Sean O'Key, Matt Stiles",
                "title": "Track Trump's plane from Florida to New York",
                "description": "Former President Donald Trump is making his way to his hometown of New York City where he is expected to voluntarily surrender after being indicted last week.",
                "url": "https://www.cnn.com/2023/04/03/politics/trump-plane-tracker-florida-new-york/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230403084848-01-trump-plane-0331.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-03T17:17:03Z",
                "content": "Former President Donald Trump is making his way to his hometown of New York City where he is expected to voluntarily surrender after being indicted last week. \r\nHe will leave his gated Florida Resort… [+891 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell, Kristen Holmes",
                "title": "Trump expected to sit for deposition this week in civil lawsuit brought by New York attorney general",
                "description": "Former President Donald Trump is expected to be back in New York City to face another legal battle Thursday -- this time in a civil lawsuit filed by New York Attorney General Letitia James, multiple sources told CNN.",
                "url": "https://www.cnn.com/2023/04/10/politics/trump-deposition-civil-lawsuit/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404134422-08-trump-arraignment-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-10T21:58:32Z",
                "content": "Former President Donald Trump is expected to be back in New York City to face another legal battle Thursday this time in a civil lawsuit filed by New York Attorney General Letitia James, multiple sou… [+2681 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Zachary Cohen,Katelyn Polantz",
                "title": "Trump attorney Boris Epshteyn to sit down with federal prosecutors investigating former president",
                "description": "Boris Epshteyn, an attorney and adviser to Donald Trump, is scheduled to be interviewed on Thursday by federal prosecutors working for special counsel Jack Smith, a source familiar with the matter told CNN.",
                "url": "https://www.cnn.com/2023/04/19/politics/boris-epshteyn-special-counsel-investigation/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230419174539-boris-epshteyn-file-041923.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-19T22:40:23Z",
                "content": "Boris Epshteyn, an attorney and adviser to Donald Trump, is scheduled to be interviewed on Thursday by federal prosecutors working for special counsel Jack Smith, a source familiar with the matter to… [+1695 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Lauren del Valle",
                "title": "Fiery opening statements mark beginning of E. Jean Carroll battery and defamation trial against Trump",
                "description": "E. Jean Carroll and two other women will testify in the battery and defamation trial against former President Donald Trump to show Trump's pattern of alleged violent behavior, Carroll's attorney told jurors during opening statements on Tuesday.",
                "url": "https://www.cnn.com/2023/04/25/politics/carroll-trump-trial-day-one/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230425095905-01-trump-e-jean-carroll-lawsuit.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-25T22:22:53Z",
                "content": "E. Jean Carroll and two other women will testify in the battery and defamation trial against former President Donald Trump to show Trumps pattern of alleged violent behavior, Carrolls attorney told j… [+5067 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Katelyn Polantz,Kaitlan Collins,Kristen Holmes",
                "title": "Top Trump attorney recused himself from handling Mar-a-Lago case",
                "description": "Attorney Evan Corcoran recused himself from representing former President Donald Trump in the special counsel investigation related to the Mar-a-Lago documents given that he testified for investigators, two sources familiar with the matter told CNN.",
                "url": "https://www.cnn.com/2023/04/15/politics/evan-corcoran-donald-trump-mar-a-lago-case/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230210174026-evan-corcoran-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-15T21:10:08Z",
                "content": "Attorney Evan Corcoran recused himself from representing former President Donald Trump in the special counsel investigation related to the Mar-a-Lago documents given that he testified for investigato… [+2980 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Katelyn Polantz",
                "title": "Trump's attendance at rape and defamation trial against him would be a 'burden' on the city, his lawyer says",
                "description": "Donald Trump's attorney on Wednesday said the former president \"wishes\" to appear at next week's civil trial where a jury will hear columnist E. Jean Carroll's assault and defamation claims against him -- but his attendance should not be necessary because it …",
                "url": "https://www.cnn.com/2023/04/19/politics/trump-carroll-trial-attendance/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404122113-17-trump-arraignment-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-19T20:41:39Z",
                "content": "Donald Trumps attorney on Wednesday said the former president wishes to appear at next weeks civil trial where a jury will hear columnist E. Jean Carrolls assault and defamation claims against him bu… [+1575 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Annie Grayer, Sara Murray, Zachary Cohen, Alayna Treene",
                "title": "Jordan seeks testimony from senior counsel to Manhattan DA in connection to Trump probe",
                "description": "House Judiciary Chairman Jim Jordan is expanding his investigation into the Manhattan District Attorney's office by seeking voluntary cooperation from the office's senior counsel, Matthew Colangelo.",
                "url": "https://www.cnn.com/2023/04/07/politics/house-republicans-manhattan-da/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230301202906-jim-jordan-file-010923.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-07T18:50:02Z",
                "content": "House Judiciary Chairman Jim Jordan is expanding his investigation into the Manhattan District Attorneys office by seeking voluntary cooperation from the offices senior counsel, Matthew Colangelo. \r\n… [+1473 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jeremy Herb",
                "title": "Donald Trump to appear in court and be charged in historic moment Tuesday",
                "description": "Donald Trump will officially become the first former president to face criminal charges Tuesday when he's arraigned in a New York courtroom -- an appearance that is expected to be quick and routine but represents a surreal and historic moment in US history.",
                "url": "https://www.cnn.com/2023/04/04/politics/donald-trump-arraignment-new-york/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230403165727-03-trump-trump-tower-230403.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T09:30:53Z",
                "content": "Donald Trump will officially become the first former president to face criminal charges Tuesday when hes arraigned in a New York courtroom an appearance that is expected to be quick and routine but r… [+2837 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Stephen Collinson",
                "title": "Analysis: Fox News' defamation battle isn't stopping Trump's election lies",
                "description": "The defamation clash between Fox News and a small election services firm, due to go to trial this week, represents the most significant moment yet in which those who disseminated former President Donald Trump's false claims that the 2020 election was stolen m…",
                "url": "https://www.cnn.com/2023/04/17/politics/trump-election-lies-fox-news-defamation/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230415111342-07-trump-mar-a-lago-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-17T04:12:16Z",
                "content": "The defamation clash between Fox News and a small election services firm, due to go to trial this week, represents the most significant moment yet in which those who disseminated former President Don… [+9181 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Gregory Krieg,Eric Bradner",
                "title": "Trump's GOP rivals struggle to break through as former president cements frontrunner status",
                "description": "The question put to South Carolina Sen. Tim Scott, hours after he announced plans to run for the Republican presidential nomination, was a simple one: How do you plan to defeat Donald Trump?",
                "url": "https://www.cnn.com/2023/04/24/politics/republican-primary-trump-rivals/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230424111640-donald-trump-rivals.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-24T18:03:48Z",
                "content": "The question put to South Carolina Sen. Tim Scott, hours after he announced plans to run for the Republican presidential nomination, was a simple one: How do you plan to defeat Donald Trump?\r\nScott s… [+11711 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jack Forrest",
                "title": "What to know about the Trump indictment on the eve of his court appearance",
                "description": "Donald Trump, the first ex-president in history to face criminal charges, is headed to New York this week for an expected arraignment on Tuesday after being indicted last week by a Manhattan grand jury.",
                "url": "https://www.cnn.com/2023/04/03/politics/what-to-know-trump-arraignment/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230320112730-04-donald-trump-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-03T10:01:11Z",
                "content": "Donald Trump, the first ex-president in history to face criminal charges, is headed to New York this week for an expected arraignment on Tuesday after being indicted last week by a Manhattan grand ju… [+8300 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "James Wigderson",
                "title": "Opinion: Wisconsin sends an undeniable warning to the GOP",
                "description": "If Republicans are going to reverse their fortunes in these suburban counties, they're going to have to settle the abortion issue — and end the blood contract with Trump, writes James Wigderson.",
                "url": "https://www.cnn.com/2023/04/08/opinions/wisconsin-supreme-court-election-warning-wigderson/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405180255-protasiewicz-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-08T18:50:01Z",
                "content": "Editors Note: James Wigderson is the former editor of RightWisconsin.com, a conservative-leaning news website, and the author of a twice-weekly newsletter, Life, Under Construction. The views express… [+5687 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Devan Cole",
                "title": "Stormy Daniels says she's 'absolutely' willing to testify in Trump hush money trial",
                "description": "Stormy Daniels is \"absolutely\" willing to testify in Donald Trump's New York criminal trial, she said in an interview with Piers Morgan, her first comments since the former president pleaded not guilty to charges related to a hush-money payment scheme intende…",
                "url": "https://www.cnn.com/2023/04/06/politics/stormy-daniels-testimony-trump-criminal-case/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/180416172249-02-stormy-daniels-04-16-2018.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-06T16:36:59Z",
                "content": "Stormy Daniels is absolutely willing to testify in Donald Trumps New York criminal trial, she said in an interview with Piers Morgan, her first comments since the former president pleaded not guilty … [+2044 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Annie Grayer, Zachary Cohen",
                "title": "Jordan subpoenas former senior prosecutor in Manhattan DA's office in connection to probe of Trump case",
                "description": "House Judiciary Chair Jim Jordan subpoenaed former New York County Special Assistant District Attorney Mark Pomerantz for his role investigating Donald Trump and his business empire -- as House Republicans attempt to frame the recent indictment against the fo…",
                "url": "https://www.cnn.com/2023/04/06/politics/jim-jordan-subpoena/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230304091006-jim-jordan-0201.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-06T16:32:25Z",
                "content": "House Judiciary Chair Jim Jordan subpoenaed former New York County Special Assistant District Attorney Mark Pomerantz for his role investigating Donald Trump and his business empire as House Republic… [+2498 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Stephen Collinson",
                "title": "A 'surreal' day for Trump in court may only tear the country further apart",
                "description": "There were two big things to fear before Tuesday's momentous first criminal arraignment of an ex-president of the United States.",
                "url": "https://www.cnn.com/2023/04/05/politics/donald-trump-court-2024/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404110809-10-trump-arraignment-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T05:11:24Z",
                "content": "There were two big things to fear before Tuesdays momentous first criminal arraignment of an ex-president of the United States.\r\nThe first was that while Manhattan District Attorney Alvin Braggs case… [+8994 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Paul LeBlanc,Chris Boyette",
                "title": "Georgia Gov. Brian Kemp says GOP can't be 'distracted' by Trump investigations if it wants to win in 2024",
                "description": "Georgia Gov. Brian Kemp has a message for his fellow Republicans looking to win back the White House: \"We cannot get distracted.\" His remarks came a day after he offered a thinly veiled dig at Donald Trump, telling GOP donors the party needed to move on from …",
                "url": "https://www.cnn.com/2023/04/16/politics/brian-kemp-republicans-elections-distracted/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230416110842-brian-kemp-0125-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-16T17:19:37Z",
                "content": "Georgia Gov. Brian Kemp has a message for his fellow Republicans looking to win back the White House: We cannot get distracted.\r\nWe have to tell people, No. 1, what were for. No. 2, that were going t… [+2915 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Melanie Zanona,Alayna Treene,Kristen Holmes",
                "title": "Trump and DeSantis battle for Florida endorsements as rivalry heats up",
                "description": "While Florida Gov. Ron DeSantis held a meet-and-greet on Capitol Hill Tuesday evening, former President Donald Trump and his team aimed to be one step ahead -- planning a dinner at his Mar-a-Lago resort with members of the Florida congressional delegation jus…",
                "url": "https://www.cnn.com/2023/04/19/politics/trump-desantis-endorsements-battle/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221029181537-ron-desantis-donald-trump-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-19T11:41:24Z",
                "content": "While Florida Gov. Ron DeSantis held a meet-and-greet on Capitol Hill Tuesday evening, former President Donald Trump and his team aimed to be one step ahead planning a dinner at his Mar-a-Lago resort… [+13601 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Sean Lyngaas, Zachary Cohen, Donie O'Sullivan",
                "title": "Feds say online chatter of a Trump protest in NY is nothing like that seen before January 6",
                "description": "Former President Donald Trump's expected court appearance in New York on Tuesday has led to a modest outburst of online threats featuring calls for violence but US officials say the chatter has been disorganized, sporadic and lacks the coherent planning that …",
                "url": "https://www.cnn.com/2023/04/03/politics/threat-monitoring-trump/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230331100243-manhattan-district-attorney-alvin-bragg-office-230318.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-03T14:38:21Z",
                "content": "Former President Donald Trumps expected court appearance in New York on Tuesday has led to a modest outburst of online threats featuring calls for violence but US officials say the chatter has been d… [+6135 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell",
                "title": "Manhattan prosecutors ask judge to limit Trump's ability to publicize information about his criminal case",
                "description": "Prosecutors with the Manhattan district attorney's office have asked the judge overseeing Donald Trump's criminal case to impose a protective order restricting the former president's ability to publicize information about the investigation.",
                "url": "https://www.cnn.com/2023/04/25/politics/manhattan-prosecutors-trump-criminal-case/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404122113-17-trump-arraignment-0404.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-26T03:04:17Z",
                "content": "Prosecutors with the Manhattan district attorneys office have asked the judge overseeing Donald Trumps criminal case to impose a protective order restricting the former presidents ability to publiciz… [+2693 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "David Orentlicher",
                "title": "Opinion: Why the Manhattan district attorney's case against Trump is so weak",
                "description": "David Orentlicher writes that former President Donald Trump's relationship with women who claim they had extramarital affairs with him — and his alleged payments to keep them from going public — raise substantial ethical concerns, but they are not matters tha…",
                "url": "https://www.cnn.com/2023/04/05/opinions/weakness-manhattan-district-attorney-trump-case-orentlicher/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404195334-dusa-trump-cargos-moinares-explainer.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-05T15:45:41Z",
                "content": "Editors Note: David Orentlicher is the Judge Jack and Lulu Lehman Professor at the William S. Boyd School of Law at University of Nevada, Las Vegas, where he specializes in constitutional law and hea… [+5418 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Sara Murray, Kaitlan Collins, Katelyn Polantz",
                "title": "Trump asks appeals court for emergency order blocking testimony from top aides in DOJ's Jan. 6 probe",
                "description": "Former President Donald Trump's legal team is asking for emergency help from the federal appeals court in Washington, DC, to block some of his closest advisers from testifying about him to a grand jury, including former White House chief of staff Mark Meadows…",
                "url": "https://www.cnn.com/2023/04/04/politics/trump-aides-testimony-january-6/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404104253-trump-aides-testimony-january-6.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T15:09:34Z",
                "content": "Former President Donald Trumps legal team is asking for emergency help from the federal appeals court in Washington, DC, to block some of his closest advisers from testifying about him to a grand jur… [+3216 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Stephen Collinson",
                "title": "Biden set to join Trump in the 2024 race, with each making a historic bid for reelection",
                "description": "President Joe Biden is expected to launch a reelection bid like none before it on Tuesday with a call for Americans to choose him again to save democracy -- less than three years after his defeat of Donald Trump was supposed to restore normality and unite the…",
                "url": "https://www.cnn.com/2023/04/25/politics/biden-candidates-2024-field/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230424095710-02-joe-biden-lead.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-25T04:06:56Z",
                "content": "President Joe Biden is expected to launch a reelection bid like none before it on Tuesday with a call for Americans to choose him again to save democracy less than three years after his defeat of Don… [+9561 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Stephen Collinson",
                "title": "Trump is losing his capacity to control his fate with legal threats swirling",
                "description": "An ex-president who's always on the attack will no longer be the sole orchestrator of his fate.",
                "url": "https://www.cnn.com/2023/04/04/politics/trump-legal-threats-analysis/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230403204230-01a-trump-trump-tower-230403.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T04:03:12Z",
                "content": "An ex-president whos always on the attack will no longer be the sole orchestrator of his fate.\r\nWhen Donald Trump officially becomes a criminal defendant on Tuesday, hell be subject to a legal system… [+7178 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Harry Enten",
                "title": "Why 2024 could be the most boring presidential primary season ever",
                "description": "For people who write about electoral, or \"horse race,\" politics, few things are more enjoyable than an exciting presidential primary season. But the current dynamics in both parties suggest 2024 could be one of the most, if not the most, boring primary cycles…",
                "url": "https://www.cnn.com/2023/04/23/politics/2024-presidential-election-biden-trump/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230422192329-biden-trump-split-042223.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-23T17:10:35Z",
                "content": "For people who write about electoral, or horse race, politics, few things are more enjoyable than an exciting presidential primary season. \r\nSometimes, both Democrats and Republicans cooperate by hol… [+5198 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Eric Bradner,Steve Contorno,Kristen Holmes",
                "title": "GOP 2024 hopefuls attend NRA convention following mass shootings in Kentucky and Tennessee",
                "description": "A slew of 2024 GOP presidential hopefuls are traveling to Indianapolis on Friday for a National Rifle Association convention at which they will court gun rights activists in the wake of mass shootings in Kentucky and Tennessee in recent days.",
                "url": "https://www.cnn.com/2023/04/14/politics/nra-convention-republican-2024-presidential-race/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230413173558-01-nra-convention-042023.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-14T11:02:06Z",
                "content": "A slew of 2024 GOP presidential hopefuls are traveling to Indianapolis on Friday for a National Rifle Association convention at which they will court gun rights activists in the wake of mass shooting… [+9101 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Dean Obeidallah",
                "title": "Opinion: Jim Jordan holds a hearing to help Trump while ignoring revelations about Clarence Thomas",
                "description": "The House Judiciary Committee appears focused on discrediting Alvin Bragg's investigation into Donald Trump, but why isn't it looking into reports that raised red flags about Justice Clarence Thomas' financial relationship with megadonor Harlan Crow? Dean Obe…",
                "url": "https://www.cnn.com/2023/04/17/opinions/jim-jordan-clarence-thomas-judiciary-committee-obeidallah/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230406092847-justice-clarence-thomas-221007.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-17T08:29:46Z",
                "content": "Editors Note: Dean Obeidallah, a former attorney, is the host of SiriusXM radios daily program The Dean Obeidallah Show. Follow him @DeanObeidallah@masto.ai. The opinions expressed in this commentary… [+6032 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and <a href=\"/profiles/leinz-vales\">Leinz Vales</a>, CNN",
                "title": "The latest on Trump's historic indictment and felony charges",
                "description": "Former President Donald Trump pleaded not guilty to 34 felony criminal charges of falsifying business records Tuesday in a historic Manhattan court appearance on Tuesday. Follow here for the latest live news updates.",
                "url": "https://www.cnn.com/politics/live-news/donald-trump-court-charges-04-05-23/index.html",
                "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/230404122113-17-trump-arraignment-0404-super-tease.jpg",
                "publishedAt": "2023-04-05T09:14:50Z",
                "content": "Former President Donald Trump made a speech at his Mar-a-Lago resort on Tuesday night after he was arraigned in Manhattan on felony charges of falsifying business records and delivered a barrage of f… [+4677 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and Mike Hayes, CNN",
                "title": "The latest on Trump's historic indictment",
                "description": "Former President Donald Trump has been indicted by a Manhattan grand jury, marking the first time in US history that a current or former president has faced criminal charges. Follow for live news updates.",
                "url": "https://www.cnn.com/politics/live-news/trump-indictment-stormy-daniels-news-04-03-23/index.html",
                "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/230331140346-donald-trump-230304-super-tease.jpg",
                "publishedAt": "2023-04-03T11:50:17Z",
                "content": "When Donald Trump enters a New York courtroom Tuesday, hell face a seasoned judge who is no stranger to the former presidents orbit.\r\nActing New York Supreme Court Judge Juan Merchan has sentenced Tr… [+1667 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Tierney Sneed",
                "title": "Justice Department asks Supreme Court to reverse ruling striking down bump stock ban",
                "description": "The Justice Department on Friday asked the Supreme Court to take up an appeals court ruling that struck down a Trump-era federal ban on so-called bump stocks.",
                "url": "https://www.cnn.com/2023/04/07/politics/doj-supreme-court-bump-stocks/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230328100700-us-supreme-court-221003-file.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-07T22:54:53Z",
                "content": "The Justice Department on Friday asked the Supreme Court to take up an appeals court ruling that struck down a Trump-era federal ban on so-called bump stocks. \r\nThe request comes as the high court ha… [+2203 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell",
                "title": "Lawyers for Manhattan DA and House Republican meet Wednesday on intimidation claims",
                "description": "Lawyers for House Republicans and the Manhattan district attorney's office are set to square off before a federal judge Wednesday over a subpoena seeking testimony about the indictment of former President Donald Trump.",
                "url": "https://www.cnn.com/2023/04/19/politics/bragg-jordan-pomerantz-hearing/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230411151540-jim-jordan-alvin-bragg-split-02.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-19T10:00:55Z",
                "content": "Lawyers for House Republicans and the Manhattan district attorneys office are set to square off before a federal judge Wednesday over a subpoena seeking testimony about the indictment of former Presi… [+4740 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Jason Morris,Devan Cole",
                "title": "Fulton County DA says she will announce charges in Trump-related 2020 election fraud case this summer",
                "description": "Fulton County District Attorney Fani Willis plans to announce this summer whether she'll bring charges against former President Donald Trump or his allies for their attempts to overturn Georgia's 2020 election results, the Atlanta Journal-Constitution reporte…",
                "url": "https://www.cnn.com/2023/04/24/politics/fulton-county-trump-charges-decision-fani-willis-letter/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230109112258-trump-willis-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-24T21:22:02Z",
                "content": "Fulton County District Attorney Fani Willis plans to announce this summer whether shell bring charges against former President Donald Trump or his allies for their attempts to overturn Georgias 2020 … [+506 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Harry Enten",
                "title": "Why Republicans are in trouble: Trump and the abortion issue aren't going away",
                "description": "Donald Trump is now in a stronger position to win the 2024 GOP presidential nomination than he has been in months. Meanwhile, the abortion issue continues to drive Democratic voters. Both developments could be bad news for Republicans.",
                "url": "https://www.cnn.com/2023/04/09/politics/donald-trump-republicans-abortion-election-trouble/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230407172444-republicans-abortion-donald-trump-election-trouble.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-09T12:13:41Z",
                "content": "Donald Trump is now in a stronger position to win the 2024 Republican presidential nomination than he has been in months as his party rallies around him following his indictment by a New York grand j… [+4074 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Sara Murray",
                "title": "Fulton County DA says fake Trump electors are incriminating one another and wants lawyer disqualified",
                "description": "The Fulton County District Attorney's office said some fake electors for Donald Trump have implicated each other in potential criminal activity and is seeking to disqualify their lawyer, according to a new court filing.",
                "url": "https://www.cnn.com/2023/04/18/politics/fulton-county-trump-fake-electors/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230109112258-trump-willis-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-18T17:47:54Z",
                "content": "The Fulton County District Attorneys office said some fake electors for Donald Trump have implicated each other in potential criminal activity and is seeking to disqualify their lawyer, according to … [+2481 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Paul LeBlanc",
                "title": "Georgia Gov. Brian Kemp urges Republicans to move on from election fraud claims: '2020 is ancient history'",
                "description": "Georgia Gov. Brian Kemp on Saturday urged his fellow Republicans to move on from the 2020 presidential election, offering a thinly veiled dig at former President Donald Trump and his continued election grievances.",
                "url": "https://www.cnn.com/2023/04/15/politics/brian-kemp-donald-trump-republicans-2024/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230415111825-brian-kemp-2022-restricted.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-15T18:39:00Z",
                "content": "Georgia Gov. Brian Kemp on Saturday urged his fellow Republicans to move on from the 2020 presidential election, offering a thinly veiled dig at former President Donald Trump and his continued electi… [+2727 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Caolán Magee",
                "title": "Around the world, criminal charges are no barrier to high office",
                "description": "While Trump will become the first US president to face criminal charges, such cases are common among other nation's world leaders. Here are some of the current or former world leaders who also have been arrested or charged.",
                "url": "https://www.cnn.com/2023/04/04/world/trump-indictment-world-leaders-intl/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230404115845-berlusconi-kerchner-netanyahu-split.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-04T11:07:42Z",
                "content": "Donald Trump may be the first former US president to face criminal charges, but around the world many current and former leaders have been prosecuted or even spent time in jail.\r\nMany of those leader… [+4628 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Paul LeBlanc",
                "title": "Washington Post: DOJ has new evidence of potential obstruction in Trump Mar-a-Lago documents case",
                "description": "The Justice Department has obtained new evidence suggesting potential obstruction by former President Donald Trump in the agency's probe of his handling of classified documents, The Washington Post reported Sunday.",
                "url": "https://www.cnn.com/2023/04/02/politics/donald-trump-mar-a-lago-justice-department/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220907152113-mar-a-lago-file-021021.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-04-02T22:49:57Z",
                "content": "The Justice Department has obtained new evidence suggesting potential obstruction by former President Donald Trump in the agencys probe of his handling of classified documents, The Washington Post re… [+2193 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "By Mike Hayes, <a href=\"/profiles/maureen-chowdhury\">Maureen Chowdhury</a> and <a href=\"/profiles/matt-meyer\">Matt Meyer</a>, CNN",
                "title": "The latest on former President Trump's indictment",
                "description": "Former President Donald Trump has been indicted by a Manhattan grand jury, marking the first time in US history that a current or former president has faced criminal charges. Follow for live news updates.",
                "url": "https://www.cnn.com/politics/live-news/trump-indictment-stormy-daniels-news-04-02-23/index.html",
                "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/230320111636-01-donald-trump-file-super-tease.jpg",
                "publishedAt": "2023-04-02T12:18:51Z",
                "content": "Former President Donald Trump is mounting a bid for the Republican presidential nomination in 2024, even as several legal controversies swirl around him.\r\nTwo of his potential opponents in the GOP pr… [+2629 chars]"
            },
            {
                "source": {
                    "id": "cnn",
                    "name": "CNN"
                },
                "author": "Kara Scannell",
                "title": "Trump asks for mistrial in battery case, saying judge has made 'unfair and prejudicial' rulings",
                "description": "Former President Donald Trump has asked the judge to declare a mistrial in his civil battery and defamation trial, arguing the judge has made \"pervasive unfair and prejudicial rulings\" against him.",
                "url": "https://www.cnn.com/2023/05/01/politics/trump-e-jean-carroll-defamation-trial/index.html",
                "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230405082808-donald-trump-file-121220.jpg?c=16x9&q=w_800,c_fill",
                "publishedAt": "2023-05-01T11:07:01Z",
                "content": "Former President Donald Trump has asked the judge to declare a mistrial in his civil battery and defamation trial, arguing the judge has made pervasive unfair and prejudicial rulings against him.\r\nTr… [+1457 chars]"
            }
        ]
    },
    "right_wing_articles": {
        "status": "ok",
        "totalResults": 822,
        "articles": [
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Andrea Vacchiano",
                "title": "AI image generator Midjourney bans deepfakes of China's Xi Jinping 'to minimize drama'",
                "description": "AI image generator Midjourney has been scrutinized for not allowing pictures of Xi Jinping on their service, citing censorship in China and an interest in growing its Chinese audience.",
                "url": "https://www.foxnews.com/tech/ai-image-generator-midjourney-bans-deepfakes-china-xi-jinping-minimize-drama",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/midjourney1.jpg",
                "publishedAt": "2023-04-02T23:25:16Z",
                "content": "Midjourney, an AI image generator that creates realistic deepfakes, has been scrutinized recently for having a policy showing deference to China's communist government.\r\nThe company enforces a rule t… [+1783 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Emma Colton",
                "title": "Bias, deaths, autonomous cars: Expert says AI 'incidents' will double as Silicon Valley launches tech race",
                "description": "The AI Incident Database, which tracks artificial intelligence incidents such as autonomous cars killing a pedestrian, says such incidents will likely double this year.",
                "url": "https://www.foxnews.com/tech/bias-deaths-autonomous-cars-expert-says-ai-incidents-double-silicon-valley-launches-tech-race",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/aipic.png",
                "publishedAt": "2023-04-25T11:00:09Z",
                "content": "As Silicon Valley races to build powerful and popular artificial intelligence systems, troubling \"incidents\" ranging from convincing AI deepfakes, banking fraud, bias and even deaths will increase th… [+5742 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Liz Peek",
                "title": "Trump indictment's biggest winner",
                "description": "As Americans follow the story of former President Donald Trump's indictment in New York this week, there's already been a political windfall for one key Democrat with an eye on 2024.",
                "url": "https://www.foxnews.com/opinion/trump-indictments-biggest-winner",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/12/TRUMP-2.jpg",
                "publishedAt": "2023-04-04T08:00:54Z",
                "content": "Alvin Braggs case against Donald Trump is absurd, as many have pointed out. The Manhattan District Attorney is attempting to spin a misdemeanor on which the statute of limitations has expired into a … [+6303 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Thomas Catenacci",
                "title": "Protesters get physical outside NYC courthouse before Trump arraignment",
                "description": "A Trump supporter fell to the ground amid a scuffle outside the New York City court where former President Trump is scheduled to be arraigned Tuesday.",
                "url": "https://www.foxnews.com/politics/protesters-get-physical-outside-nyc-courthouse-before-trump-arraignment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1250763307.jpg",
                "publishedAt": "2023-04-04T15:40:27Z",
                "content": "A woman wearing a \"Make America Great Again\" hat fell to the ground after trampling an anti-Trump flag strewn across the ground near the New York City courthouse where former President Trump is set t… [+2363 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Kristine Parks",
                "title": "John Bolton panics over Trump charges: 'Even weaker than I thought'",
                "description": "Former Trump national security adviser John Bolton worried the Manhattan DA's charges against former President Trump were \"even weaker\" than he expected.",
                "url": "https://www.foxnews.com/media/john-bolton-panics-trump-charges-weaker-thought",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/bolton-trump.jpg",
                "publishedAt": "2023-04-05T13:03:11Z",
                "content": "Former national security adviser John Bolton feared the charges against Donald Trump were \"even weaker than I thought,\" while on CNN on Tuesday.\r\nThe former president pleaded not guilty in a New York… [+2710 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Thomas Catenacci",
                "title": "Images released of Trump's historic trip to NYC day before he's set to be arraigned",
                "description": "Former President Donald Trump was pictured Monday exiting his airplane and, later, entering Trump Tower ahead of his expected arraignment hearing in New York City later this week.",
                "url": "https://www.foxnews.com/politics/images-released-trumps-historic-trip-nyc-day-arraigned",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-Indictment_141.jpg",
                "publishedAt": "2023-04-03T20:21:41Z",
                "content": "Former President Donald Trump was photographed exiting his \"Trump Force One\" aircraft and, later, entering Trump Tower on Monday afternoon ahead of his expected court appearance in New York City this… [+2195 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Kassy Dillon, Megan Myers",
                "title": "New Yorkers in front of Trump Tower clash over former president's odds at a fair trial ahead of arraignment",
                "description": "Americans gathered outside Trump Tower in New York City told Fox News what they thought about the fairness of the upcoming trial for former President Donald Trump.",
                "url": "https://www.foxnews.com/politics/new-yorkers-front-trump-tower-clash-former-presidents-odds-fair-trial-ahead-arraignment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-Indictment_163.jpg",
                "publishedAt": "2023-04-04T06:00:17Z",
                "content": "NEW YORK CITY Americans outside Trump Tower reacted to the indictment of former President Trump as he arrived in New York City ahead of his expected arraignment.\r\n\"I think the government is messing u… [+2396 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Michael Lee",
                "title": "Trump attorney pushes back after NBC host asks if Trump is holding classified docs for payout: 'Cheap shot'",
                "description": "James Trusty, an attorney representing Donald Trump, called accusations that Trump was looking for a financial settlement over classified documents a \"cheap shot.\"",
                "url": "https://www.foxnews.com/politics/trump-attorney-pushes-back-after-nbc-host-trump-holding-classified-docs-payout-cheap-shot",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/07/GettyImages-1235540712.jpg",
                "publishedAt": "2023-04-09T17:43:20Z",
                "content": "An attorney for former President Donald Trump called out what he said was a \"cheap shot\" from NBCs Chuck Todd while discussing Trumps handling of classified documents.\r\nDuring a Sunday appearance on … [+2984 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Paul Steinhauser",
                "title": "Is New Hampshire still Trump country as the former president runs for the White House a third time?",
                "description": "Is New Hampshire — the state that rocketed Donald Trump toward the 2016 Republican nomination and eventually the White House — still Trump country in the 2024 GOP presidential primary?",
                "url": "https://www.foxnews.com/politics/is-new-hampshire-still-trump-country-former-president-runs-white-house-third-time",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/Donald-Trump-NHGOP-Salem-NH-Jan.-28-2023-e1678638122471.jpg",
                "publishedAt": "2023-04-03T08:00:58Z",
                "content": "MANCHESTER, N.H. Donald Trumps top adviser in New Hampshire says the former presidents supporters in the crucial early-voting state are starting to wake up.\r\n\"The Trump supporters have been in hibern… [+7106 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Associated Press",
                "title": "Former President Donald Trump travels to Scotland ahead of golf course opening",
                "description": "Donald Trump is opening a new golf course at his resort in Aberdeen, Scotland. Trump traveled to Scotland on May 1, 2023, ahead of the course's opening.",
                "url": "https://www.foxnews.com/world/donald-trump-travels-scotland-new-golf-course-opening",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/05/AP23121392229534.jpg",
                "publishedAt": "2023-05-01T15:25:00Z",
                "content": "Former U.S. President Donald Trump traveled to Scotland on Monday to open a new golf course at his resort near Aberdeen.\r\nTrump and his son Eric were greeted by two pipers, a red carpet and a 10-vehi… [+902 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Charles Creitz",
                "title": "Trump reflects on 'incredible' Queen Elizabeth II as he reviews 'Letters to Trump'",
                "description": "Former President Donald Trump spoke out about his relationship with the late Queen Elizabeth II, whom he met in London in 2019, on \"Life, Liberty & Levin.\"",
                "url": "https://www.foxnews.com/media/trump-reflects-incredible-queen-elizabeth-ii-reviews-letters-trump",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/06/Trump-Queen-AP-1.jpg",
                "publishedAt": "2023-04-30T11:00:14Z",
                "content": "Former President Donald Trump looked back at his friendship with the late Queen Elizabeth II as he highlighted correspondence featured in his new book, \"Letters to Trump.\"\r\nIn an interview on \"Life, … [+2668 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Hanna Panreck",
                "title": "'The View' hosts clash over Trump indictment: 'This case is not taking Donald Trump down'",
                "description": "\"The View\" co-hosts argued over the indictment of former President Donald Trump on Wednesday as Alyssa Farah Griffin said he wasn't going to go to jail for this.",
                "url": "https://www.foxnews.com/media/the-view-hosts-clash-over-trump-indictment-case-not-taking-donald-trump-down",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/SUNNY-HOSTIN-ALYSSA-FARAH-GRIFFIN-TRUMP.jpg",
                "publishedAt": "2023-04-05T17:05:50Z",
                "content": "\"The View\" hosts clashed on Wednesday over the indictment and arraignment of former President Donald Trump as co-host Alyssa Farah Griffin argued that the case was \"not taking Donald Trump down.\"\r\n\"T… [+3030 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Trump indictment by Manhattan grand jury unsealed",
                "description": "Former President Donald Trump pleaded not guilty in New York City court Tuesday after being charged with 34 felony counts of falsifying business records in the first degree.",
                "url": "https://www.foxnews.com/politics/trump-charges",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-courtroom3.jpg",
                "publishedAt": "2023-04-04T18:57:21Z",
                "content": "Former President Donald Trump pleaded not guilty in New York City court Tuesday after being charged with 34 felony counts of falsifying business records in the first degree. \r\nThe charges came out of… [+2326 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Aubrie Spady",
                "title": "Head-to-head polls show Trump weakness vs. Biden, underwater approval",
                "description": "Recent polls found that former President Donald Trump has a lower approval rating than President Biden.",
                "url": "https://www.foxnews.com/politics/head-polls-show-trump-weakness-biden-underwater-approval",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Trump-Biden-november-2021-2.jpg",
                "publishedAt": "2023-04-11T20:45:52Z",
                "content": "As the highly anticipated 2024 presidential race kicks off, several recent polls indicate President Joe Biden has a higher approval rating than former President Donald Trump as he faces criminal char… [+2941 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News Staff",
                "title": "Maria Bartiromo breaks down Trump's indictment with Rep. Jim Jordan, Alina Habba, John Ratcliffe, and more",
                "description": "Maria Bartiromo speaks exclusively with guests on the indictment of former President Donald Trump.",
                "url": "https://www.foxnews.com/media/maria-bartiromo-breaks-down-trumps-indictment-rep-jim-jordan-alina-habba-john-ratcliffe",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/maria-bartiromo.jpg",
                "publishedAt": "2023-04-02T17:52:06Z",
                "content": "JIM JORDAN TELLS MARIA BARTIROMO \"EVERYTHING IS ON THE TABLE\" AFTER THE INDICTMENT OF DONALD TRUMP\r\nMARIA BARTIROMO: Well, what are you. When are you expecting to speak with Alvin Bragg if he does no… [+9889 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Hanna Panreck",
                "title": "NBC host wonders if Trump, Biden in 'co-dependent relationship': 'Really needs Donald Trump to be the nominee'",
                "description": "Chuck Todd, host of NBC's \"Meet the Press,\" asked a group of panelists on Sunday if President Biden and Donald Trump were in a \"co-dependent relationship.\"",
                "url": "https://www.foxnews.com/media/nbc-host-wonders-trump-biden-codependent-relationship-really-needs-donald-trump-nominee",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/CHUCK-TODD-BIDEN-ANNOUNCEMENT.jpg",
                "publishedAt": "2023-04-30T20:00:59Z",
                "content": "NBC's \"Meet the Press\" host Chuck Todd asked his panelists on Sunday if President Biden and former president Trump were in a \"co-dependent\" relationship and said the president \"really needs\" Trump to… [+3523 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News",
                "title": "Trump rails against DA Bragg, Chicago gets new mayor after booting Lightfoot and more top headlines",
                "description": "Trump rails against DA Bragg, Chicago gets new mayor after booting Lightfoot and more top headlines.",
                "url": "https://www.foxnews.com/us/trump-rails-against-bragg-chicago-mayor-brandon-johnson-replaces-lori-lightfoot",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/trump.png",
                "publishedAt": "2023-04-05T11:54:13Z",
                "content": "Good morning and welcome to Fox News morning newsletter, Fox News First. Subscribe now to get Fox News First in your email. And here's what you need to know to start your day ...\r\nTRUMP'S RESPONSE - … [+3311 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News Staff",
                "title": "Biden's failing narrative on Hunter's business dealings, Trump arrives back in NYC and more top headlines",
                "description": "Biden's failing narrative on Hunter's business dealings, Trump arrives back in NYC and more top headlines",
                "url": "https://www.foxnews.com/us/bidens-failing-narrative-on-hunters-business-dealings-trump-arrives-back-in-manhattan",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Joe-Hunter-Biden.jpg",
                "publishedAt": "2023-04-13T10:49:12Z",
                "content": "Good morning and welcome to Fox News morning newsletter, Fox News First. Subscribe now to get Fox News First in your email. And here's what you need to know to start your day ...\r\nFAILING NARRATIVE -… [+3613 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News Staff",
                "title": "Trump's legal issues will be a distraction for our country: Asa Hutchinson",
                "description": "Support grows among the Republican base for former President Donald Trump as his indictment case continues.",
                "url": "https://www.foxnews.com/media/trumps-legal-issues-distraction-country-asa-hutchinson",
                "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f4850372-c1ac-412b-ad1d-058e27304062/0542b4be-b96f-4358-a011-1a70e69a48b7/1280x720/match/image.jpg",
                "publishedAt": "2023-04-04T00:13:15Z",
                "content": "2024 presidential candidate Asa Hutchinson told \"Your World\" Monday that the country's focus on Donald Trump's legal issues is \"disappointing\" and undermines the strength of the presidency. The forme… [+1964 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Trump slams Bragg after pleading not guilty: 'I never thought anything like this could happen in America'",
                "description": "Former President Trump slammed Manhattan District Attorney Alvin Bragg Tuesday from Mar-a-Lago, just hours after pleading not guilty to 34 counts of falsifying business records in the first degree related to alleged hush-money payments made ahead of the 2016 …",
                "url": "https://www.foxnews.com/politics/trump-slams-bragg-plead-not-guilty-never-thought-anything-like-this-happen-america",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/DJTv2.jpg",
                "publishedAt": "2023-04-05T01:21:27Z",
                "content": "Former President Trump slammed Manhattan District Attorney Alvin Bragg Tuesday from Mar-a-Lago, just hours after pleading not guilty to falsifying business records related to alleged hush-money payme… [+7715 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Timothy Nerozzi",
                "title": "Trump makes surprise visit to Florida pizza place, hands out slices to supporters",
                "description": "Former President Donald Trump hosted an impromptu pizza party with a crowd of supporters on Friday in Fort Myers, Florida.",
                "url": "https://www.foxnews.com/politics/trump-makes-surprise-visit-florida-pizza-place-hands-out-slices-supporters",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/AP23112117614825-e1682179750479.jpg",
                "publishedAt": "2023-04-22T17:35:12Z",
                "content": "Former President Donald Trump held an impromptu pizza party with his supporters Friday after a campaign speech.\r\nTrump made a surprise visit to Downtown House of Pizza in Fort Myers, Florida, on Frid… [+1830 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News Staff",
                "title": "Jim Jordan slams the left for targeting any opposition: 'Most scary thing of all'",
                "description": "Rep. Jim Jordan, R-Ohio, discusses the indictment and prosecution of former President Trump by Manhattan District Attorney Alvin Bragg.",
                "url": "https://www.foxnews.com/media/jim-jordan-slams-left-targeting-any-opposition-most-scary-thing",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/01/BARTIROMO-JORDAN-SPLIT-SMF.jpg",
                "publishedAt": "2023-04-02T19:30:17Z",
                "content": "Ohio Congressman Jim Jordan, R, joined \"Sunday Morning Futures\" to react to the indictment of former President Trump by Manhattan District Attorney Alvin Bragg. Jordan warned host Maria Bartiromo of … [+1809 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News",
                "title": "Judge rules on cameras for Trump arraignment, basketball star laughs off FLOTUS wish and more top headlines",
                "description": "Judge rules on cameras for Trump arraignment, basketball star laughs off FLOTUS wish and more top headlines.",
                "url": "https://www.foxnews.com/us/judge-ruling-cameras-trump-arraignment-college-basketball-star-angel-reese-white-house-invitation-more-top-headlines",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/trump-bragg-cameras.jpg",
                "publishedAt": "2023-04-04T11:44:57Z",
                "content": "Good morning and welcome to Fox News morning newsletter, Fox News First. Subscribe now to get Fox News First in your email. And here's what you need to know to start your day ...\r\nBEHIND CLOSED DOORS… [+3515 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Gabriel Hays",
                "title": "Reporters grill Jean-Pierre for dodging Trump questions: Why did you talk about him before?",
                "description": "White House Press Secretary Karine Jean-Pierre annoyed reporters on Friday after dodging their questions about former President Donald Trump.",
                "url": "https://www.foxnews.com/media/reporters-grill-jean-pierre-dodging-trump-questions-why-did-you-talk-him-before",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Jean-Pierre-Trump.png",
                "publishedAt": "2023-04-21T20:15:19Z",
                "content": "White House Press Secretary Karine Jean-Pierre had a tense exchange with reporters Friday after attempting to dodge answering a question about former President Donald Trump.\r\nAgence France-Presse rep… [+3958 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Anders Hagstrom",
                "title": "Trump campaign raises staggering amount in 48 hours after indictment news: report",
                "description": "Supporters of Former President Donald Trump donated more than $5 million to his cause in the 48 hours after he was indicted in New York City late Thursday.",
                "url": "https://www.foxnews.com/politics/trump-campaign-raises-staggering-amount-48-hours-indictment-news-report",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/05/Donald-Trump-Durham-Sussmann-Trial.jpg",
                "publishedAt": "2023-04-02T12:22:09Z",
                "content": "Former President Donald Trump raked in more than $5 million in donations in the 48 hours after he was indicted on Thursday.\r\nTrump's supporters threw in $4 million in the first 24 hours alone, follow… [+2343 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Trump to be deposed Thursday in New York as part of AG Letitia James' lawsuit",
                "description": "Former President Trump is expected to appear for a deposition Thursday as part of New York State Attorney General Letitia James’ years-long investigation into his businesses and his family.",
                "url": "https://www.foxnews.com/politics/trump-deposed-thursday-new-york-ag-letitia-james-lawsuit",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/09/letitia-james-donald-trump-split.jpg",
                "publishedAt": "2023-04-13T15:00:11Z",
                "content": "Former President Trump is expected to appear for a deposition Thursday as part of New York State Attorney General Letitia James years-long investigation into his businesses and his family.\r\nThe forme… [+3232 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Lawrence Richard",
                "title": "Florida Reps. Gus Bilirakis, Michael Waltz endorse Trump over DeSantis in 2024 election: 'The right leader'",
                "description": "Reps. Gus Bilirakis and Michael Waltz have joined eight of their Florida colleagues in backing former President Trump over Gov. Ron DeSantis in the 2024 election.",
                "url": "https://www.foxnews.com/politics/florida-reps-gus-bilirakis-michael-waltz-endorse-trump-desantis-2024-election-right-leader",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/florida-reps-trump.jpg",
                "publishedAt": "2023-04-21T05:44:42Z",
                "content": "Two U.S. Representatives from the state of Florida, Reps. Gus Bilirakis and Michael Waltz, have endorsed former President Donald Trump over their own states governor to be the next President of the U… [+2735 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Isabelle McDonnell, Megan Myers, Teny Sahakian",
                "title": "Biden vs. Trump. Americans weigh in on possible 2024 rematch",
                "description": "Americans in Tennessee and Maryland predicted who would win in another face off for the Oval Office between Donald Trump and Joe Biden in the 2024 election.",
                "url": "https://www.foxnews.com/politics/biden-trump-americans-weigh-in-on-possible-2024-rematch",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1229228819.jpg",
                "publishedAt": "2023-04-30T06:00:36Z",
                "content": "Americans in Nashville and Baltimore told Fox News who they think would win in an election rematch between President Biden and former President Trump in 2024. \r\n\"To be honest with you, even though he… [+1997 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Lawrence Richard",
                "title": "Sen. Steve Daines, Lee Zeldin endorse Trump to be next president: 'Best four years'",
                "description": "Sen. Steve Daines, a Republican from Montana, and former Rep. Lee Zeldin, a Republican from New York, both endorsed Donald Trump to be the next President of the United States.",
                "url": "https://www.foxnews.com/politics/sen-steve-daines-lee-zeldin-endorse-trump-next-president-best-four-years",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1482272203-1.jpg",
                "publishedAt": "2023-04-25T09:59:29Z",
                "content": "Former President Donald Trump picked up a key congressional endorsement for his 2024 presidential bid Monday, continuing to show he enjoys wide support from Capitol Hill.\r\nSen. Steve Daines, R-Mont.,… [+1656 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Lawrence Richard",
                "title": "Sens. Blackburn, Hagerty and Reps. Steube, Rose endorse Trump for president",
                "description": "Several members of Congress endorsed former President Donald J. Trump over the weekend, continuing a streak of support as Republicans find their candidate for 2024.",
                "url": "https://www.foxnews.com/politics/sens-blackburn-hagerty-reps-greg-steube-rose-endorse-trump-president",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1439614717.jpg",
                "publishedAt": "2023-04-18T08:14:17Z",
                "content": "Former President Donald Trump has picked up several more endorsements on Capitol Hill as he seeks re-election in a potential rematch with President Biden.\r\nOn Monday, the Trump campaign shared Rep. G… [+5185 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Adam Shaw",
                "title": "Trump takes heat from right for saying he didn't 'hit' Newsom because Calif gov said nice things about him",
                "description": "Former President Donald Trump received some pushback from some on the right in the wake of comments he made about California Gov. Gavin Newsom being nice to him.",
                "url": "https://www.foxnews.com/politics/trump-takes-heat-right-saying-he-didnt-hit-newsom-because-calif-gov-said-nice-things-him",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-Indictment_152.jpg",
                "publishedAt": "2023-04-12T20:34:30Z",
                "content": "Former President Donald Trump is receiving criticism from some on the right in the wake of comments he made in which he said he \"could never hit\" California Gov. Gavin Newsom because the liberal Demo… [+2478 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Anders Hagstrom",
                "title": "Trump to return to NYC to face questioning over fraud lawsuit",
                "description": "New York Attorney General Letitia James has summoned former President Trump to NYC for a deposition on her fraud lawsuit against him and his company, according to reports.",
                "url": "https://www.foxnews.com/politics/trump-return-nyc-face-questioning-fraud-lawsuit",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/01/trump-ag-letitia-james.jpg",
                "publishedAt": "2023-04-11T12:36:47Z",
                "content": "Former President Trump will return to New York City this week to face questioning regarding Attorney General Letitia James' fraud lawsuit against him and the Trump Organization.\r\nTrump is expected to… [+1979 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Lawrence Richard",
                "title": "Trump arrives in Manhattan ahead of deposition in New York Attorney General Letitia James' case",
                "description": "Former President Donald Trump took to social media to announce he returned to Manhattan for a deposition Thursday in front of New York Attorney General Letitia James.",
                "url": "https://www.foxnews.com/politics/trump-arrives-manhattan-ahead-deposition-new-york-attorney-general-letitia-james-case",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1251765603.jpg",
                "publishedAt": "2023-04-13T09:00:58Z",
                "content": "Former President Donald Trump arrived in Manhattan late Wednesday evening, he revealed on social media, as he is set to appear before New York Attorney General Letitia James for a deposition on Thurs… [+2758 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Kyle Morris",
                "title": "Pro-DeSantis PAC offers to pay for Trump to move out of Florida after he called it the 'worst state'",
                "description": "A super PAC supporting a potential White House bid from Ron DeSantis said Saturday it will financially support former President Donald Trump's move to California after calling Florida the “worst state.\"",
                "url": "https://www.foxnews.com/politics/pro-desantis-pac-offers-pay-trump-move-out-florida-after-he-called-it-worst-state",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/4c2609fb-Untitled-1.jpg",
                "publishedAt": "2023-04-22T16:37:44Z",
                "content": "A super PAC supporting a potential White House bid from Florida Gov. Ron DeSantis said Saturday it will financially support former President Donald Trump's move to California just one day after the G… [+3528 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Bradford Betz",
                "title": "Trump awarded nearly $122K in attorney fees from Stormy Daniels",
                "description": "Former President Trump was awarded nearly $122,000 in Stormy Daniels Tuesday after pleading not guilty to 34 counts of falsifying business records.",
                "url": "https://www.foxnews.com/politics/trump-awarded-nearly-122k-attorney-fees-stormy-daniels",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Stormy-Daniels-Trump-court.jpg",
                "publishedAt": "2023-04-04T20:18:43Z",
                "content": "Former President Donald Trump on Tuesday was awarded nearly $122,000 in attorney fees from Stormy Daniels, the porn star at the center of hush money payment during the 2016 campaign. \r\nThe former pre… [+1532 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Jeffrey Clark",
                "title": "Americans warned to ‘beware a flood of fake Trump mugshots’ powered by AI in advance of arraignment",
                "description": "Americans are being warned that AI-generated images of Donald Trump's mugshot — some of which already exist online — will soon be taking over the internet.",
                "url": "https://www.foxnews.com/media/americans-warned-beware-flood-fake-trump-mugshots-powered-ai-advance-arraignment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-Mugshot-fake.png",
                "publishedAt": "2023-04-04T15:35:24Z",
                "content": "A number of media outlets issued a warning to Americans in advance of Donald Trump's arraignment in New York City, telling them that fake mugshots of the former president may soon flood the internet.… [+2579 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Aubrie Spady",
                "title": "AOC suggests DeSantis would be the 'weaker' 2024 GOP nominee: 'That base belongs to Donald Trump'",
                "description": "AOC suggested that a presidential run from Gov. Ron DeSantis would be \"weaker\" than former President Donald Trump's 2024 bid.",
                "url": "https://www.foxnews.com/politics/aoc-desantis-weaker-2024-gop-nominee-base-belongs-donald-trump",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/AOC-DeSantis.jpg",
                "publishedAt": "2023-04-24T20:14:50Z",
                "content": "Rep. Alexandria Ocasio Cortez, D-N.Y., said she thinks that Florida Governor Ron DeSantis is \"weaker\" than former President Donald Trump, as polls show DeSantis faring better than Trump against Presi… [+2040 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Michael Lee",
                "title": "John Bolton fears Trump indictment will act as accelerant on his campaign: 'Rocket fuel'",
                "description": "Former national security adviser John Bolton said he fears the indictment announced against Trump may serve as \"rocket fuel\" that propels the former president to the GOP nomination.",
                "url": "https://www.foxnews.com/politics/john-bolton-fears-trump-indictment-act-accelerant-campaign-rocket-fuel",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/bolton-trump.jpg",
                "publishedAt": "2023-04-02T19:16:30Z",
                "content": "Former national security adviser John Bolton argued that the indictment of Donald Trump may ultimately help the former president politically, saying it could be \"rocket fuel\" that helps him secure th… [+2402 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Trump retires 'Crooked Hillary' nickname, unveils ‘Crooked Joe Biden’",
                "description": "Former President Trump said “Crooked Joe Biden\" poses a “threat to democracy,\" vowing to “crush\" him at the ballot box in November 2024 and to “settle our unfinished business\" and “rescue America\" from another four years of “disastrous\" Democratic policies.",
                "url": "https://www.foxnews.com/politics/trump-retires-crooked-hillary-nickname-unveils-crooked-joe-biden",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/d38adb7e-Trump.jpg",
                "publishedAt": "2023-04-27T21:54:07Z",
                "content": "Former President Trump said \"Crooked Joe Biden\" poses a \"threat to democracy,\" vowing to \"crush\" him at the ballot box in November 2024 and to \"settle our unfinished business.\" \r\nTrump hosted a campa… [+5057 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Trump sues former attorney Michael Cohen for $500 million",
                "description": "EXCLUSIVE: Former President Trump is suing his ex-lawyer Michael Cohen for more than $500 million, alleging a breach of his attorney-client relationship, unjust enrichment and more, Fox News Digital has learned.",
                "url": "https://www.foxnews.com/politics/trump-sues-michael-cohen-for-500-million",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/michael-cohen-trump.jpg",
                "publishedAt": "2023-04-12T17:55:52Z",
                "content": "EXCLUSIVE: Former President Trump is suing his ex-lawyer Michael Cohen for more than $500 million, alleging a breach of his attorney-client relationship, unjust enrichment, and more, Fox News Digital… [+6986 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Greg Wehner",
                "title": "Mexico president opposes charges brought against Trump, calling them political",
                "description": "Mexico president Andrés Manuel López Obrador sided with former President Trump, saying the charges brought against him are political in nature, during an election cycle.",
                "url": "https://www.foxnews.com/politics/mexico-president-opposes-charges-brought-against-trump-calling-political",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/AP23094658854991.jpg",
                "publishedAt": "2023-04-05T22:17:33Z",
                "content": "Mexico President Andrés Manuel López Obrador suggested on Wednesday that the charges brought against former U.S. President Donald Trump were politically charged and presented during an election cycle… [+2727 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Haley Chi-Sing",
                "title": "NYPD cops brace for chaos amid Trump arraignment frenzy",
                "description": "NYPD officers and other law enforcement lined New York City streets ahead of former President Trump's scheduled court appearance at Manhattan courthouse.",
                "url": "https://www.foxnews.com/politics/nypd-cops-brace-chaos-amid-trump-arraignment-frenzy",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-protestors-NYC.jpg",
                "publishedAt": "2023-04-04T18:01:17Z",
                "content": "NYPD officers and courthouse police lined New York City streets early Tuesday afternoon in preparation for the expected public frenzy following former President Trump's arraignment. \r\nOfficers and pa… [+1525 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Chad Pergram",
                "title": "For Republicans, Trump overshadows political wins in the House",
                "description": "Republicans' celebration of the Lower Energy Costs Act was quickly overshadowed by Trump's indictment and arraignment in New York, showing his dominance of conservative politics.",
                "url": "https://www.foxnews.com/politics/republicans-trump-overshadows-political-wins-house",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/congress_energy3.jpg",
                "publishedAt": "2023-04-06T16:21:04Z",
                "content": "A squadron of House Republicans stood, glowing, atop a small set of choir risers in the Rayburn Room just off the House floor last Thursday. \r\nHouse Republicans had just approved the touchstone of th… [+7130 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Trump hires new defense attorney on eve of NYC arraignment",
                "description": "Former President Trump on Monday hired white collar defense attorney Todd Blanche to lead his legal team ahead of his arraignment in New York City, Fox News Digital has learned.",
                "url": "https://www.foxnews.com/politics/trump-hires-new-defense-attorney-eve-nyc-arraignment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/d38adb7e-Trump.jpg",
                "publishedAt": "2023-04-03T19:26:27Z",
                "content": "Former President Trump on Monday hired white collar defense attorney Todd Blanche to be part of his legal team ahead of his Tuesday arraignment in New York City, Fox News Digital has learned.\r\nBlanch… [+3035 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News Staff",
                "title": "JESSE WATTERS: Trump probe is such a hit job",
                "description": "Fox News host Jesse Watters calls out Manhattan DA Alvin Bragg and Democrats for attacking former President Donald Trump on \"Jesse Watters Primetime.\"",
                "url": "https://www.foxnews.com/media/jesse-watters-trump-probe-such-hit-job",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Jesse-Watters-This-entire-case-is-a-sham.jpg",
                "publishedAt": "2023-04-05T00:21:28Z",
                "content": "Fox News host Jesse Watters calls former President Donald Trump's indictment a \"sham\" on \"Jesse Watters Primetime.\"\r\nJESSE WATTERS:This entire case is a sham. The only people more clueless than Bragg… [+1574 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Hanna Panreck",
                "title": "Legal analysts, prominent journalists worry over 'flimsy,' 'underwhelming' Trump indictment",
                "description": "Pundits, legal analysts, and former government officials seemed to worried over the indictment of Donald Trump and said the case was \"underwhelming\" and \"flimsy.\"",
                "url": "https://www.foxnews.com/media/legal-analysts-prominent-journalists-worry-over-flimsy-underwhelming-trump-indictment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/Trump1.jpg",
                "publishedAt": "2023-04-05T20:02:36Z",
                "content": "Several members of the media and former government officials seemed worried over a \"flimsy\" and \"underwhelming\" indictment against former president Donald Trump on Tuesday. \r\nCNN legal analyst Carrie… [+5362 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Paul Steinhauser",
                "title": "Trump indictment fuels the former president’s 2024 campaign fundraising",
                "description": "Donald Trump and his 2024 White House campaign are cashing in on the former president’s indictment and recent arraignment in New York City, with a huge boost in fundraising",
                "url": "https://www.foxnews.com/politics/trump-indictment-fuels-former-presidents-2024-campaign-fundraising",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Donald-Trump-Mar-a-Lago-April-4-2023.jpg",
                "publishedAt": "2023-04-15T16:58:39Z",
                "content": "Donald Trump and his 2024 White House campaign are cashing in on the former presidents indictment and recent arraignment in New York City.\r\nTrump brought in nearly $18.8 million in the January-March … [+4401 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Danielle Wallace",
                "title": "Adams, NYPD commissioner hold security briefing ahead of Trump arraignment",
                "description": "New York City Mayor Eric Adams and NYPD Commissioner Keechant Sewell held a briefing at City Hall regarding security preps ahead of former President Trump's arrival.",
                "url": "https://www.foxnews.com/politics/adams-nypd-commissioner-hold-security-briefing-ahead-trump-arraignment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/adams-trump-sewell.jpg",
                "publishedAt": "2023-04-03T16:08:32Z",
                "content": "New York City Mayor Eric Adams and NYPD Commissioner Keechant Sewell held a briefing Monday regarding security preps for former President Donald Trump's arraignment. \r\n\"Control yourselves,\" Adams sai… [+2909 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Karoline Leavitt to join Trump super PAC as spokeswoman",
                "description": "Karoline Leavitt is joining former President Trump's Super PAC, Make America Great Again Inc., as national spokeswoman, Fox News has learned.",
                "url": "https://www.foxnews.com/politics/karoline-leavitt-join-trump-super-pac-spokeswoman",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/IMG_7982.jpg",
                "publishedAt": "2023-04-03T18:14:09Z",
                "content": "EXCLUSIVE: Karoline Leavitt is joining former President Trump's Super PAC, Make America Great Again Inc., as national spokeswoman, Fox News has learned. \r\nLeavitt will join MAGA Inc., under CEO Taylo… [+1188 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Charles Creitz",
                "title": "Donald Trump dishes on past friendship with Bill Clinton",
                "description": "Former President Donald Trump recounted his past friendship with former President Bill Clinton and what he thinks would have helped Hillary Clinton campaign on \"Life, Liberty & Levin.\"",
                "url": "https://www.foxnews.com/media/donald-trump-dishes-past-friendship-bill-clinton",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/trump-clinton-reuters.jpg",
                "publishedAt": "2023-04-23T11:00:22Z",
                "content": "Former President Donald Trump might currently be the Clintons' most high-profile political foil, but that wasn't always the case, he told Fox News.\r\nTrump told \"Life, Liberty &amp; Levin\" he used to … [+2954 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Chris Pandolfo",
                "title": "Florida commission slaps down Trump PAC's ethics complaint against DeSantis",
                "description": "The Florida Commission on Ethics has dismissed a complaint filed by allies of former President Donald Trump who accused Gov. Ron DeSantis of accepting illegal gifts.",
                "url": "https://www.foxnews.com/politics/florida-commission-slaps-down-trump-pac-ethics-complaint-against-desantis",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/florida-gov-ron-desantis-heritage-summit.jpg",
                "publishedAt": "2023-04-29T18:32:10Z",
                "content": "The Florida Commission on Ethics has dismissed a complaint filed by allies of former President Trump who accused Republican Gov. Ron DeSantis of coordinating a \"shadow presidential campaign.\" \r\nMake … [+5371 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Kyle Morris",
                "title": "READ THE INDICTMENT: Trump charged with 34 felony counts of falsifying business records",
                "description": "Former President Donald Trump was charged Tuesday in a Manhattan court with 34 felony counts of falsifying business records in the first degree.",
                "url": "https://www.foxnews.com/politics/read-indictment-trump-charged-34-felony-counts-falsifying-business-records",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-courtroom.jpg",
                "publishedAt": "2023-04-04T20:13:15Z",
                "content": "Former President Donald Trump was charged Tuesday in a Manhattan court with 34 felony counts of falsifying business records in the first degree.\r\nTrump, the leading Republican in the 2024 race for th… [+1509 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brianna Herlihy",
                "title": "Byron Donalds endorses Trump for president: 'Strength and resolve'",
                "description": "Republican Congressman Byron Donalds of Florida on Thursday endorsed former President Trump in his race for the White House in 2024.",
                "url": "https://www.foxnews.com/politics/byron-donalds-endorses-trump-president-strength-resolve",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/01/GettyImages-1425246870.jpg",
                "publishedAt": "2023-04-06T16:14:36Z",
                "content": "Rep. Byron Donalds on Thursday endorsed former President Trump in his race for the White House in 2024.\r\n\"There is only one leader at this time in our nation's history who can seize the moment and de… [+1756 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brianna Herlihy",
                "title": "Blackburn endorses Trump for president: 'Can't wait until he's back'",
                "description": "Tennessee Republican Senator Marsha Blackburn on Monday endorsed Donald Trump for president in 2024, adding to the growing list of Republicans in Trump's column.",
                "url": "https://www.foxnews.com/politics/blackburn-endorses-trump-president-cant-wait-back",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/Marsha-Blackburn.jpg",
                "publishedAt": "2023-04-17T12:51:35Z",
                "content": "Tennessee Senator Marsha Blackburn on Monday endorsed Donald Trump for president, adding to the growing list of elected Republican officials endorsing the former president.\r\n\"Under President Trump, o… [+975 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Rebecca Rosenberg",
                "title": "Donald Trump case highlights New York court's history in headlines",
                "description": "Donald Trump’s case is the latest high-profile drama in the Manhattan courthouse, from John Lennon's killer pleading guilty to P. Diddy's gun possession and bribery trial.",
                "url": "https://www.foxnews.com/us/donald-trump-case-highlights-new-york-courts-history-headlines",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Julia-threeway.jpg",
                "publishedAt": "2023-04-07T10:00:29Z",
                "content": "Donald Trumps seismic criminal case could be the most sensational proceeding in the history of Manhattans New York City courthouse but the spectacle follows a long line of celebrity defendants whove … [+6060 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "Trump being arraigned in Manhattan court on grand jury charges",
                "description": "Former President Donald Trump surrendered to the Manhattan District Attorney’s Office and is being arraigned in court Tuesday afternoon after being indicted by a grand jury last week.",
                "url": "https://www.foxnews.com/politics/trump-arraigned",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-NYC1.jpg",
                "publishedAt": "2023-04-04T18:28:58Z",
                "content": "Former President Donald Trump is being arraigned in court Tuesday afternoon after surrendering to the Manhattan District Attorneys Office earlier in the afternoon.\r\nThe former president of the United… [+4106 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Howard Kurtz",
                "title": "Tongue-tied Trump rivals can’t trash their indicted tormentor",
                "description": "Having been indicted, Donald Trump doesn’t seem bound by the usual rules of political gravity. Not only is he staying in the presidential race, but he’s also been surging in the polls.",
                "url": "https://www.foxnews.com/media/tongue-tied-trump-rivals-cant-trash-their-indicted-tormentor",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/08/donald-trump-leaves-trump-tower-new-york-city.jpg",
                "publishedAt": "2023-04-04T07:12:06Z",
                "content": "Lets ponder for a moment an imaginary Senate race between Smith and Jones.\r\nIn the heat of the campaign, Smith gets indicted. And its not just any indictment, but criminal charges involving funneling… [+4017 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Houston Keene",
                "title": "DeSantis PAC ad targets Trump comments about needing to 'fight' NRA ahead of his speech at NRA forum",
                "description": "Never Back Down, the super PAC backing Florida Gov. Ron DeSantis for president in 2024, dropped a new ad targeting former President Trump's gun record ahead of an NRA forum.",
                "url": "https://www.foxnews.com/politics/desantis-pac-ad-targets-trump-comments-about-needing-fight-nra-ahead-speech-nra-forum",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/02/DeSantis-Trump.gif",
                "publishedAt": "2023-04-14T21:57:14Z",
                "content": "FIRST ON FOX: The super PAC backing Florida Gov. Ron DeSantis for president in 2024 dropped a new ad going after former President Trump\r\n with the two prominent Republicans slated to speak at the Nat… [+3009 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Lorraine Taylor",
                "title": "Trump confirms he will appear in court in New York City on Tuesday following his indictment",
                "description": "Former President Donald Trump confirmed via Truth Social that he will arrive in New York City on Monday ahead of his arraignment in court on Tuesday.",
                "url": "https://www.foxnews.com/politics/trump-confirms-he-will-appear-court-new-york-city-tuesday-following-indictment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/1d7d12f8-Trump.jpg",
                "publishedAt": "2023-04-03T05:01:27Z",
                "content": "Former President Donald Trump confirmed he will leave his Florida resort on Monday to travel to New York City where he will appear in court on Tuesday following his indictment.\r\n\"I will be leaving Ma… [+3770 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Anders Hagstrom",
                "title": "Court rejects Trump's request for month-long delay in defamation trial",
                "description": "Former President Donald Trump's defamation trial against rape accusder E. Jean Carroll will move forward as planned on April 25 after a federal judge denied his request for a delay.",
                "url": "https://www.foxnews.com/politics/court-rejects-trumps-request-month-long-delay-defamation-trial",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1482272179.jpg",
                "publishedAt": "2023-04-17T15:08:24Z",
                "content": "A federal judge in Manhattan rejected former President Donald Trump's request for a month-long delay in his upcoming defamation trial relating to his response to rape accusations from columnist E. Je… [+2408 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Adam Shaw",
                "title": "Ex-FBI Director James Comey hails ‘another good day’ after Trump arraignment",
                "description": "James Comey, who was fired as FBI Director in 2017, hailed the arraignment of former President Donald Trump on felony charges as \"another good day\" on Tuesday.",
                "url": "https://www.foxnews.com/politics/ex-fbi-director-james-comey-hails-another-good-day-trump-arraignment",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/08/GettyImages-1229490635.jpg",
                "publishedAt": "2023-04-05T16:11:42Z",
                "content": "Former FBI Director James Comey described \"another good day\" on Tuesday, an apparently reference to the arraignment of former President Donald Trump on felony charges.\r\n\"Another good day,\" Comey twee… [+2069 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Tucker Carlson",
                "title": "TUCKER CARLSON: They want to take out Trump",
                "description": "Fox News host Tucker Carlson calls out Alvin Bragg's leadership in going after former President Donald Trump on Monday's \"Tucker Carlson Tonight.\"",
                "url": "https://www.foxnews.com/opinion/tucker-carlson-they-want-take-out-trump",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Video-2023-04-03T201940.333.jpg",
                "publishedAt": "2023-04-04T02:09:32Z",
                "content": "Here's a story from over the weekend. At about 5 a.m. on Saturday morning in Manhattan, a parking garage attendant called Moussa Diarra noticed a man peering into parked cars looking for things to st… [+12609 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brandon Gillespie",
                "title": "Trump mocks DeSantis, Pence during stump speech at NRA convention",
                "description": "Former President Donald Trump mocked former Vice President Mike Pence and Republican Florida Gov. Ron DeSantis during his speech to the NRA convention.",
                "url": "https://www.foxnews.com/politics/trump-mocks-desantis-pence-stump-speech-nra-convention",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1482271182-1.jpg",
                "publishedAt": "2023-04-15T02:25:34Z",
                "content": "Former President Donald Trump used his speech at the annual National Rifle Association convention on Friday to mock former Vice President Mike Pence and Republican Florida Gov. Ron DeSantis while mak… [+2175 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Anders Hagstrom",
                "title": "Mike Pence won’t contest subpoena to testify in Trump investigation",
                "description": "Former Vice President Mike Pence will no longer contest a special counsel subpoena after he won a court case limiting what prosecutors can ask of him in the testimony.",
                "url": "https://www.foxnews.com/politics/mike-pence-wont-contest-subpoena-testify-trump-investigation",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/07/Mike-Pence-Speech-Young-Americas-Foundation.jpg",
                "publishedAt": "2023-04-06T13:18:34Z",
                "content": "Former Vice President Mike Pence will not contest a subpoena to testify for the special counsel investigation into former President Trump, his office announced late Wednesday.\r\nPence's newfound willi… [+2312 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Paul Steinhauser",
                "title": "Former Trump campaign official joins Ramaswamy's 2024 GOP bid",
                "description": "A top supporter of former President Donald Trump in the crucial early voting state of New Hampshire is jumping ship and joining rival Republican candidate Vivek Ramaswamy’s campaign.",
                "url": "https://www.foxnews.com/politics/former-trump-campaign-official-joins-ramaswamys-2024-gop-bid",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Fred-Doucette-Donald-Trump-Manchester-NH-Feb.-11-2020.jpg",
                "publishedAt": "2023-04-06T10:00:43Z",
                "content": "A top supporter of former President Donald Trump in the crucial early voting state of New Hampshire is jumping ship and joining rival Republican candidate Vivek Ramaswamys campaign.\r\nLongtime state R… [+5459 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Anders Hagstrom",
                "title": "New York police barricade Trump Tower ahead of courtroom surrender",
                "description": "New York police are preparing for potential protests this week as former President Donald Trump is expected to turn himself in to authorities on Tuesday.",
                "url": "https://www.foxnews.com/politics/new-york-police-barricade-trump-tower-courtroom-surrender",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/NYPD.gif",
                "publishedAt": "2023-04-03T14:28:43Z",
                "content": "New York police are already erecting barricades around Trump Tower in anticipation of former President Trump's surrender to authorities sometime this week.\r\nNYPD officers have also blocked roads arou… [+3171 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brandon Gillespie",
                "title": "Stormy Daniels gloats over Trump arraignment with X-rated tweet",
                "description": "Stormy Daniels gloated over former President Donald Trump's arraignment in a New York City court with an X-rated tweet that included sexual references.",
                "url": "https://www.foxnews.com/politics/stormy-daniels-gloats-trump-arraignment-x-rated-tweet",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Stormy-Daniels-Trump-court.jpg",
                "publishedAt": "2023-04-04T19:51:16Z",
                "content": "Porn actress Stormy Daniels reacted to former President Donald Trump's arraignment in a Manhattan court on Tuesday with a vulgar tweet gloating over not being \"under arrest.\"\r\n\"Y'all keep saying c-- … [+868 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Jonathan Turley",
                "title": "Donald Trump indictment ignores this core legal principle",
                "description": "Many have raised objections to the effort of Manhattan District Attorney to use a flawed legal theory.",
                "url": "https://www.foxnews.com/opinion/donald-trump-indictment-ignores-this-core-legal-principle",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Alvin-Bragg-Trump-arraignment.jpg",
                "publishedAt": "2023-04-04T21:31:15Z",
                "content": "Oscar Wilde once said \"The only way to get rid of a temptation is to yield to it. Resist it, and your soul grows sick with longing for the things it has forbidden to itself.\" \r\nWith the release of th… [+5424 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Chris Pandolfo",
                "title": "Biden admin review of Afghanistan withdrawal repeatedly blames Trump",
                "description": "The White House on Thursday released its review of the Biden administration's 2021 military withdrawal from Afghanistan, repeatedly blaming the Trump administration.",
                "url": "https://www.foxnews.com/politics/biden-admin-review-of-afghanistan-withdrawal-repeatedly-blames-trump",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/602f477e-Biden.jpg",
                "publishedAt": "2023-04-06T17:38:30Z",
                "content": "The White House on Thursday released its review of the widely-criticized U.S. withdrawal from Afghanistan in 2021.\r\nThe document repeatedly criticizes the Trump administration for constraining the co… [+939 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Anders Hagstrom",
                "title": "Pro-DeSantis super PAC unloads on Trump for friendly fire in first TV ad",
                "description": "A major super PAC supporting Florida Gov. Ron DeSantis criticized former President Trump in its first-ever TV ad released Sunday. The ad pushed back on Trump's own attacks.",
                "url": "https://www.foxnews.com/politics/pro-desantis-super-pac-unloads-trump-friendly-fire-first-tv-ad",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/02/DeSantis-Trump.gif",
                "publishedAt": "2023-04-16T18:19:23Z",
                "content": "A  super PAC supporting Florida Gov. Ron DeSantis released its first-ever television ad attacking former President Donald Trump on Sunday, pushing back on Trump's own aggression toward DeSantis.\r\nNev… [+1994 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News Staff",
                "title": "Fox News Politics: MAGA hits Manhattan",
                "description": "Get the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content",
                "url": "https://www.foxnews.com/politics/fox-news-politics-maga-hits-manhattan",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-NYC.jpg",
                "publishedAt": "2023-04-04T18:06:02Z",
                "content": "Top Stories\r\nTRUMP SURRENDERS FOR INDICTMENT: Former President Trump is at a New York City courthouse for a scheduled arraignment Tuesday afternoon. He's surrendering for arrest and was scheduled to … [+3214 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brooke Singman",
                "title": "DNC slams Trump for nicknaming 'Crooked Joe Biden,' says they have a 'better' one: 'Winner'",
                "description": "FIRST ON FOX: The Democratic National Committee slammed former President Trump for nicknaming President Biden “Crooked Joe Biden,\" saying they have a “better\" one—“winner.\"",
                "url": "https://www.foxnews.com/politics/dnc-slams-trump-nicknaming-crooked-joe-biden-says-they-have-better-one-winner",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/07/GettyImages-1242019513.jpg",
                "publishedAt": "2023-04-27T23:06:06Z",
                "content": "FIRST ON FOX: The Democratic National Committee slammed former President Trump for nicknaming President Biden \"Crooked Joe Biden,\" saying they have a \"better\" one\"winner.\"\r\nThe DNC was reacting to th… [+2017 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Fox News Staff",
                "title": "LAURA INGRAHAM: If Trump was retiring, Bragg would not have indicted him",
                "description": "Fox News host Laura Ingraham explains the political agenda behind Manhattan DA Alvin Bragg's indictment of former President Donald Trump on \"The Ingraham Angle.\"",
                "url": "https://www.foxnews.com/media/laura-ingraham-trump-was-retiring-bragg-would-not-have-indicted-him",
                "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f0fac9fc-eb98-47ef-9794-1f7e97d1db33/781fa7e3-da1c-4b69-ba18-06d431f1b524/1280x720/match/image.jpg",
                "publishedAt": "2023-04-05T04:22:57Z",
                "content": "Laura Ingraham calls out the \"real reason\" former President Donald Trump was indicted by Manhattan DA Alvin Bragg on \"The Ingraham Angle.\"\r\nTRUMP INDICTMENT: LIVE UPDATES\r\nLAURA INGRAHAM: Here's the … [+938 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Gabriel Hays",
                "title": "Media figures celebrate Donald Trump’s arrest: ‘This is a great day!’",
                "description": "Liberals on Twitter reacted with joy over the news that Donald Trump was finally arrested on charges related to a payment to porn star Stormy Daniels.",
                "url": "https://www.foxnews.com/media/media-liberals-celebrate-donald-trumps-arrest-great-day",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-Indictment_152.jpg",
                "publishedAt": "2023-04-04T19:37:06Z",
                "content": "Prominent liberals in news media, Hollywood and on social media took to Twitter Tuesday to celebrate the arrest of former President Donald Trump.\r\nTrump went into the custody of New York City law enf… [+2747 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Chris Pandolfo",
                "title": "Graham says indictment will help Trump win South Carolina 2024 primary",
                "description": "Sen. Lindsey Graham said former President Trump's indictment is \"legally unsound\" and \"politically motivated,\" predicting it will help him win the South Carolina presidential primary next year.",
                "url": "https://www.foxnews.com/politics/graham-says-indictment-will-help-trump-win-south-carolina-2024-primary",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/south-carolina-senator-lindsey-graham-speaks-at-gop-headquarters-trump-indictment.jpg",
                "publishedAt": "2023-04-06T17:10:31Z",
                "content": "Sen. Lindsey Graham, R-S.C., said Tuesday that Donald Trump's indictment by the Manhattan District Attorney's Office will boost the former president's chances of winning South Carolina's presidential… [+3075 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Yael Halon",
                "title": "Trump indictment may have given him 'the kiss of life' for 2024, veteran pollster says: 'Like oxygen to fire'",
                "description": "Veteran pollster Craig Keshishian examines the political impact of the former president's indictment on his 2024 presidential bid, warning Democrats to expect 'backlash.'",
                "url": "https://www.foxnews.com/media/trump-indictment-kiss-life-2024-veteran-pollster-oxygen-fire",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/Trump-1.jpg",
                "publishedAt": "2023-04-04T10:00:57Z",
                "content": "Democrats have given former President Donald Trump an unintended political boost with the criminal indictment and upcoming arraignment Tuesday as polls show more voters rallying behind the current 20… [+3420 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Aubrie Spady",
                "title": "SEE IT: Hillary Clinton lives it up at lavish dinner as Trump battles Manhattan charges",
                "description": "Former Secretary of State Hillary Clinton was honored at a New York City club Tuesday night, just hours after former President Trump was arraigned.",
                "url": "https://www.foxnews.com/politics/hillary-clinton-lives-lavish-dinner-trump-battles-manhattan-charges",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Clinton-2.gif",
                "publishedAt": "2023-04-05T17:04:44Z",
                "content": "Hillary Clinton, former secretary of State and former Democratic presidential nominee, was seen enjoying a lavish night out in New York City, just hours after her 2016 opponent, former President Dona… [+1302 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Aaron Kliegman",
                "title": "Trump, Newsom echo each other's attacks in effort to take down DeSantis",
                "description": "On the surface, Donald Trump and Gavin Newsom would seem to be political foes, but recently they appear to share the same goal: taking down Ron DeSantis.",
                "url": "https://www.foxnews.com/politics/trump-newsom-echo-each-others-attacks-effort-take-down-desantis",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Newsom-Trump-Desantis.jpg",
                "publishedAt": "2023-04-14T19:14:27Z",
                "content": "On the surface, former President Donald Trump and California Gov. Gavin Newsom would seem to be political foes, but they appear to share the same goal: taking down Florida Gov. Ron DeSantis.\r\nIn rece… [+7195 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Howard Kurtz",
                "title": "As expected, Trump indictment all about falsifying records – for hush money",
                "description": "The biggest bombshell from former President Trump's Tuesday hearing is the figurative kind, a former Playboy model allegedly paid off by the National Enquirer.",
                "url": "https://www.foxnews.com/shows/media-buzz/trump-indictment-falsifying-records-hush-money",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/Trump1.jpg",
                "publishedAt": "2023-04-05T07:03:50Z",
                "content": "In the end, Alvin Bragg didnt really have anything new: the 34 felony counts in the indictment of Donald Trump, unsealed yesterday, are mainly about how he paid hush money.\r\nTrump, who was only brief… [+5140 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Mark Penn",
                "title": "Donald Trump indictment changes 2024 race, but not the way you think",
                "description": "Former President Donald Trump's presidential campaign has been invigorated by the indictment.",
                "url": "https://www.foxnews.com/opinion/donald-trump-indictment-changes-2024-race-not-way-you-think",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/trump.png",
                "publishedAt": "2023-04-06T06:00:22Z",
                "content": "Former President Donald Trumps presidential campaign has been invigorated by the indictment by New Yorks Manhattan DA on flimsy charges of falsifying business records seven years ago. The former pres… [+5132 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Ryan Gaydos",
                "title": "Joe Burrow, Odell Beckham Jr appear to greet Trump at UFC 287",
                "description": "Former President Donald Trump appeared to be greeted by Joe Burrow and Odell Beckham Jr. on Saturday night as they all took in UFC 287 in Miami.",
                "url": "https://www.foxnews.com/sports/joe-burrow-odell-beckham-jr-appear-greet-trump-ufc-287",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Donald-Trump.jpg",
                "publishedAt": "2023-04-11T15:57:07Z",
                "content": "Former President Donald Trump made an appearance at UFC 287 in Miami over the weekend and went viral for snaps taken with Dana White, Mike Tyson and Kid Rock.\r\nOn Monday, another photo emerged of wha… [+1565 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Timothy Nerozzi",
                "title": "Trump catapults to top of GOP presidential primary race, overturning DeSantis' 14-point lead: poll",
                "description": "Former President Trump took the lead against Florida Gov. Ron DeSantis in a hypothetical GOP presidential primary, according to a new Wall Street Journal poll.",
                "url": "https://www.foxnews.com/politics/trump-catapults-top-gop-presidential-primary-race-overturning-desantis-14-point-lead-poll",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-Desantis-stay-in-florida.jpg",
                "publishedAt": "2023-04-21T16:35:34Z",
                "content": "Former President Trump has turned the Republican presidential primary on its head within four months, turning a 14-point deficit to Florida Gov. Ron DeSantis into a 13-point lead, in a new Wall Stree… [+1860 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Aubrie Spady",
                "title": "Most Americans support Trump indictment, but think politics played a role in AG decision: poll",
                "description": "A new CNN poll reveals that while a majority of Americans support the indictment of former President Trump, more than 75% of the respondents believe politics played a role.",
                "url": "https://www.foxnews.com/politics/most-americans-support-trump-indictment-think-politics-played-role-poll",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/trump-bragg.jpg",
                "publishedAt": "2023-04-03T19:34:59Z",
                "content": "While the majority of Americans support the indictment of former President Donald Trump amid his 2024 presidential campaign, a new poll also revealed most individuals believe politics played a role i… [+1568 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Gabriel Hays",
                "title": "ESPN's Stephen A. Smith defends Trump from racism allegations: 'He’s not against Black people'",
                "description": "ESPN commentator Stephen A. Smith defended former President Trump from accusations that he's a racist during an interview at the Semafor Media Summit.",
                "url": "https://www.foxnews.com/media/espns-stephen-smith-defends-trump-racism-allegations-not-against-black-people",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Smith_Trump.png",
                "publishedAt": "2023-04-11T17:59:39Z",
                "content": "ESPN commentator Stephen A. Smith defended former President Donald Trump from accusations that hes a racist, saying Trump's \"not against Black people\" during a new interview, while reiterating he wou… [+2411 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Lawrence Richard",
                "title": "Trump sounds off on Biden, Alvin Bragg, Jack Smith on social media hours before arraignment: 'This is illegal'",
                "description": "Donald Trump ranted on social media about his indictment and upcoming arraignment at a Manhattan courthouse and told District Attorney Alvin Bragg to 'indict himself.'",
                "url": "https://www.foxnews.com/politics/trump-sounds-off-biden-alvin-bragg-jack-smith-social-media-hours-arraignment-illegal",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/GettyImages-1250753494.jpg",
                "publishedAt": "2023-04-04T07:59:46Z",
                "content": "Former President Donald Trump took to social media late Monday evening, the day before he will be arraigned in a New York courtroom, to call for the very district attorney bringing charges against hi… [+2184 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Joe Silverstein",
                "title": "Trump chides DeSantis for lack of loyalty: 'You just don't do what he did'",
                "description": "Former President Trump criticized Gov. DeSantis for a lack of \"loyalty\" and credited his endorsement as being crucial to the Florida governor during an interview with \"Full Send\" podcast.",
                "url": "https://www.foxnews.com/media/trump-chides-desantis-for-lack-of-loyalty-you-just-dont-do-what-he-did",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/01/TRUMP-3.jpg",
                "publishedAt": "2023-04-21T12:00:16Z",
                "content": "Former President Trump sharply criticized Gov. Ron DeSantis, R-Fla., in an interview on the popular \"Full Send\" podcast that streamed live on YouTube Thursday. \r\nDeSantis, who polls show trailing Tru… [+2093 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Rebecca Rosenberg",
                "title": "Trump's new lawyer Todd Blanche got Manafort indictment dismissed",
                "description": "Trump's new attorney, Todd Blanche, got a criminal indictment against Paul Manafort dropped in a major victory against the Manhattan District Attorney's Office.",
                "url": "https://www.foxnews.com/us/trumps-new-lawyer-todd-blanche-got-manafort-indictment-dismissed",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Manafort-Trump.jpg",
                "publishedAt": "2023-04-03T23:20:20Z",
                "content": "Donald Trump\r\n's new lawyer successfully got a criminal case against the former president's one-time campaign manager, Paul Manafort, dismissed in the same courthouse where Trump will face charges on… [+2628 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Paul Steinhauser, Adam Sabes",
                "title": "Trump campaign rakes in over $10 million since indictment announcement, sells photoshopped 'mugshot' T-shirt",
                "description": "Former President Trump's campaign says it has brought in over $10 million in donations since his indictment was announced March 30.",
                "url": "https://www.foxnews.com/politics/trump-campaign-rakes-over-10-million-since-indictment-announcement-sells-photoshopped-mugshot-t-shirt",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Trump-courtroom2.jpg",
                "publishedAt": "2023-04-05T21:04:24Z",
                "content": "The presidential campaign of former President Donald Trump's 2024 bid says it has brought in over $10 million in donations since an indictment against him was announced a week ago.\r\nTrump was indicte… [+2599 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Charles Creitz",
                "title": "Bragg's timeline of Trump election-influence allegations doesn't add up: Ex-federal prosecutor",
                "description": "Former Assistant U.S. Attorney Andrew McCarthy called out DA Alvin Bragg on \"Jesse Watters Primetime\" after identifying an apparent chronological miscue.",
                "url": "https://www.foxnews.com/media/braggs-timeline-trump-election-influence-allegations-doesnt-add-up-ex-federal-prosecutor",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/bragg-trump.jpg",
                "publishedAt": "2023-04-05T01:39:20Z",
                "content": "New York County District Attorney Alvin Bragg's election interferencebased prosecutorial reasoning against former President Donald Trump should be considered flawed if the true timeline of the NDA pa… [+2848 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Aaron Kliegman",
                "title": "El Salvador president blasts Trump indictment: 'Just imagine if this happened in any other country'",
                "description": "The president of El Salvador slammed the indictment of Donald Trump, suggesting it would now be hypocritical for the U.S. to promote democracy with its foreign policy.",
                "url": "https://www.foxnews.com/politics/el-salvador-president-blasts-trump-indictment-imagine-happened-other-country",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/nayib-bukele-trump.jpg",
                "publishedAt": "2023-04-05T14:12:05Z",
                "content": "Nayib Bukele, the president of El Salvador, slammed the indictment of former President Donald Trump, suggesting it would now be hypocritical for the U.S. to promote democracy with its foreign policy.… [+3497 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Elizabeth Elkind",
                "title": "Trump allies slam his arrest as attack on rule of law: ‘A dark day for our country’",
                "description": "Former President Donald Trump's allies in Congress are accusing DA Alvin Bragg of going after the former president to derail his 2024 White House bid",
                "url": "https://www.foxnews.com/politics/trump-allies-slam-arrest-attack-rule-law-dark-day-country",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/12/TRUMP-2.jpg",
                "publishedAt": "2023-04-04T19:55:41Z",
                "content": "Former President Trumps allies in Congress say his Tuesday arrest in New York City is an attack on the rule of law and the U.S. justice system, after they embattled Republican leader plead \"not guilt… [+3531 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Chris Pandolfo",
                "title": "Former Labor Secretary Reich says election officials should refuse to put Trump on 2024 ballot over 'treason'",
                "description": "Former Clinton-era labor secretary Robert Reich urged secretaries of state to bar former President Donald Trump from the 2024 presidential ballot, accusing him of \"treason.\"",
                "url": "https://www.foxnews.com/politics/former-labor-secretary-reich-says-election-officials-should-refuse-put-trump-2024-ballot-treason",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/former-labor-secretary-robert-reich.jpg",
                "publishedAt": "2023-04-25T17:11:48Z",
                "content": "Former Democratic Labor Secretary Robert Reich called for secretaries of state to refuse to place former President Trump's name on the ballot in 2024, accusing the former president of \"treason.\" \r\n\"T… [+3669 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Rebecca Rosenberg",
                "title": "Donald Trump's NYC case may be headed in only one direction, former prosecutors reveal",
                "description": "New York City District Attorney Alvin Bragg's criminal case against former president Donald Trump faces major legal hurdles, experts told Fox News Digital.",
                "url": "https://www.foxnews.com/us/donald-trump-nyc-case-may-be-headed-only-one-direction-former-prosecutors-reveal",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/dc6e282c-Brag-Trump-split-color-correct.jpg",
                "publishedAt": "2023-04-14T11:00:14Z",
                "content": "Donald Trump was indicted recently on 34 felony counts of falsifying business records but New York City prosecutor Alvin Bragg's case against the former president faces significant legal hurdles, exp… [+5975 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Howard Kurtz",
                "title": "Trump defies judge with new round of stinging attacks on prosecutors",
                "description": "Judge Juan Merchan warned former President Trump to tone down his rhetoric or a gag order will be imposed ahead of his speech at Mar-a-Lago Tuesday evening.",
                "url": "https://www.foxnews.com/shows/media-buzz/trump-defies-judge-with-new-round-stinging-attacks-prosecutors",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/02/GettyImages-1246629315.jpg",
                "publishedAt": "2023-04-06T07:00:52Z",
                "content": "The judge had warned Donald Trump: Tone down the rhetoric or he might have to impose a gag order.\r\n\"Please refrain from making statements that are likely to incite violence or civil unrest,\" Judge Ju… [+4254 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Michael Lee",
                "title": "Trump's arraignment: everything you need to know about the timeline of the legal proceedings",
                "description": "The timeline for where the case against former President Trump goes from here remains uncertain, with some speculating proceedings could drag on until after the election.",
                "url": "https://www.foxnews.com/politics/trumps-arraignment-everything-you-need-know-about-timeline-legal-proceedings",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/trump-bragg.jpg",
                "publishedAt": "2023-04-03T10:30:00Z",
                "content": "Former President Trump is expected to have a busy Tuesday, starting the day with his arraignment in a New York courtroom before flying back to Florida, where he is expected to deliver remarks later t… [+5677 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Charles Creitz",
                "title": "Trump: Democrats using the 'old Soviet process' to crush opponents like me",
                "description": "Former President Donald Trump joined 'Tucker Carlson Tonight' for a wide-ranging exclusive interview, wherein he discussed his indictment, presidential campaign and more.",
                "url": "https://www.foxnews.com/media/trump-democrats-old-soviet-process-crush-opponents",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/dc6e282c-Brag-Trump-split-color-correct.jpg",
                "publishedAt": "2023-04-12T02:08:45Z",
                "content": "Former President Donald Trump sounded off on Democratic prosecutors investigating and lodging legal cases against him as he runs for the White House, telling \"Tucker Carlson Tonight\" in an exclusive … [+3571 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Megan Myers",
                "title": "New Yorkers pan Manhattan DA Alvin Bragg for not prosecuting 'real criminals' as he arrests Trump",
                "description": "New Yorkers criticized Manhattan District Attorney Alvin Bragg as former President Trump was arraigned amid continued concerns over violent crime in the city.",
                "url": "https://www.foxnews.com/politics/new-yorkers-pan-manhattan-da-alvin-bragg-prosecuting-real-criminals-arrests-trump",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/bragg-trump.jpg",
                "publishedAt": "2023-04-07T12:00:33Z",
                "content": "NEW YORK CITY New Yorkers criticized the Manhattan district attorney for downgrading some serious criminal charges as he arrested former President Trump amid concerns over the city's violent crime. \r… [+3609 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Brandon Gillespie",
                "title": "WATCH: GOP voters weigh in on 2024 choice for president, shred 'bogus' Trump charges",
                "description": "Voters attending the NRA's annual convention in Indianapolis shared with Fox News Digital their first choice for president in 2024, and slammed the charges brought against Donald Trump.",
                "url": "https://www.foxnews.com/politics/gop-voters-weigh-in-2024-choice-president-shred-trump-charges",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/MOS.jpg",
                "publishedAt": "2023-04-17T21:59:45Z",
                "content": "INDIANAPOLIS Republican voters attending the National Rifle Association's annual convention over the weekend who spoke with Fox News Digital about the 2024 race for president were unanimous when it c… [+2611 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Chris Pandolfo",
                "title": "Biden aides cheer for Trump to be 2024 GOP nominee amid indictment: report",
                "description": "President Biden's advisers appear to be cheering on the prospect of facing former President Donald Trump in a 2024 rematch, according to a report.",
                "url": "https://www.foxnews.com/politics/biden-aides-cheer-trump-2024-gop-nominee-indictment-report",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/trump-biden-split.jpg",
                "publishedAt": "2023-04-04T18:16:12Z",
                "content": "As former President Donald Trump faces arraignment in a Manhattan court Tuesday over alleged hush money payments to a porn star, President Biden's top advisers appear to be cheering him on in the Rep… [+4283 chars]"
            },
            {
                "source": {
                    "id": "fox-news",
                    "name": "Fox News"
                },
                "author": "Houston Keene",
                "title": "Manchin's sole campaign staffer called to ‘hang’ Trump on social media",
                "description": "The sole campaign staffer for Senator Joe Manchin called for former President Trump to \"hang\" on social media, Fox News Digital has learned.",
                "url": "https://www.foxnews.com/politics/manchins-sole-campaign-staffer-called-hang-trump-on-social-media",
                "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/05/joe-manchin-wva-5.2.22.jpg",
                "publishedAt": "2023-04-18T15:30:31Z",
                "content": "FIRST ON FOX: Democrat West Virginia Senator Joe Manchins\r\n apparent sole current campaign staffer called for former President Trump to \"hang\" on social media, Fox News Digital has learned.\r\nCharlie … [+3873 chars]"
            }
        ]
    }
}